GopalSaraf/Practicals/PSDL/include/proc/pic18f26k83.inc
// Register: B2D4
#define B2D4 B2D4
B2D4                                     equ 0376Ah
// bitfield definitions
B2D4_B2D4_POSN                           equ 0000h
B2D4_B2D4_POSITION                       equ 0000h
B2D4_B2D4_SIZE                           equ 0008h
B2D4_B2D4_LENGTH                         equ 0008h
B2D4_B2D4_MASK                           equ 00FFh
B2D4_B2D40_POSN                          equ 0000h
B2D4_B2D40_POSITION                      equ 0000h
B2D4_B2D40_SIZE                          equ 0001h
B2D4_B2D40_LENGTH                        equ 0001h
B2D4_B2D40_MASK                          equ 0001h
B2D4_B2D41_POSN                          equ 0001h
B2D4_B2D41_POSITION                      equ 0001h
B2D4_B2D41_SIZE                          equ 0001h
B2D4_B2D41_LENGTH                        equ 0001h
B2D4_B2D41_MASK                          equ 0002h
B2D4_B2D42_POSN                          equ 0002h
B2D4_B2D42_POSITION                      equ 0002h
B2D4_B2D42_SIZE                          equ 0001h
B2D4_B2D42_LENGTH                        equ 0001h
B2D4_B2D42_MASK                          equ 0004h
B2D4_B2D43_POSN                          equ 0003h
B2D4_B2D43_POSITION                      equ 0003h
B2D4_B2D43_SIZE                          equ 0001h
B2D4_B2D43_LENGTH                        equ 0001h
B2D4_B2D43_MASK                          equ 0008h
B2D4_B2D44_POSN                          equ 0004h
B2D4_B2D44_POSITION                      equ 0004h
B2D4_B2D44_SIZE                          equ 0001h
B2D4_B2D44_LENGTH                        equ 0001h
B2D4_B2D44_MASK                          equ 0010h
B2D4_B2D45_POSN                          equ 0005h
B2D4_B2D45_POSITION                      equ 0005h
B2D4_B2D45_SIZE                          equ 0001h
B2D4_B2D45_LENGTH                        equ 0001h
B2D4_B2D45_MASK                          equ 0020h
B2D4_B2D46_POSN                          equ 0006h
B2D4_B2D46_POSITION                      equ 0006h
B2D4_B2D46_SIZE                          equ 0001h
B2D4_B2D46_LENGTH                        equ 0001h
B2D4_B2D46_MASK                          equ 0040h
B2D4_B2D47_POSN                          equ 0007h
B2D4_B2D47_POSITION                      equ 0007h
B2D4_B2D47_SIZE                          equ 0001h
B2D4_B2D47_LENGTH                        equ 0001h
B2D4_B2D47_MASK                          equ 0080h

// Register: B2D5
#define B2D5 B2D5
B2D5                                     equ 0376Bh
// bitfield definitions
B2D5_B2D5_POSN                           equ 0000h
B2D5_B2D5_POSITION                       equ 0000h
B2D5_B2D5_SIZE                           equ 0008h
B2D5_B2D5_LENGTH                         equ 0008h
B2D5_B2D5_MASK                           equ 00FFh
B2D5_B2D50_POSN                          equ 0000h
B2D5_B2D50_POSITION                      equ 0000h
B2D5_B2D50_SIZE                          equ 0001h
B2D5_B2D50_LENGTH                        equ 0001h
B2D5_B2D50_MASK                          equ 0001h
B2D5_B2D51_POSN                          equ 0001h
B2D5_B2D51_POSITION                      equ 0001h
B2D5_B2D51_SIZE                          equ 0001h
B2D5_B2D51_LENGTH                        equ 0001h
B2D5_B2D51_MASK                          equ 0002h
B2D5_B2D52_POSN                          equ 0002h
B2D5_B2D52_POSITION                      equ 0002h
B2D5_B2D52_SIZE                          equ 0001h
B2D5_B2D52_LENGTH                        equ 0001h
B2D5_B2D52_MASK                          equ 0004h
B2D5_B2D53_POSN                          equ 0003h
B2D5_B2D53_POSITION                      equ 0003h
B2D5_B2D53_SIZE                          equ 0001h
B2D5_B2D53_LENGTH                        equ 0001h
B2D5_B2D53_MASK                          equ 0008h
B2D5_B2D54_POSN                          equ 0004h
B2D5_B2D54_POSITION                      equ 0004h
B2D5_B2D54_SIZE                          equ 0001h
B2D5_B2D54_LENGTH                        equ 0001h
B2D5_B2D54_MASK                          equ 0010h
B2D5_B2D55_POSN                          equ 0005h
B2D5_B2D55_POSITION                      equ 0005h
B2D5_B2D55_SIZE                          equ 0001h
B2D5_B2D55_LENGTH                        equ 0001h
B2D5_B2D55_MASK                          equ 0020h
B2D5_B2D56_POSN                          equ 0006h
B2D5_B2D56_POSITION                      equ 0006h
B2D5_B2D56_SIZE                          equ 0001h
B2D5_B2D56_LENGTH                        equ 0001h
B2D5_B2D56_MASK                          equ 0040h
B2D5_B2D57_POSN                          equ 0007h
B2D5_B2D57_POSITION                      equ 0007h
B2D5_B2D57_SIZE                          equ 0001h
B2D5_B2D57_LENGTH                        equ 0001h
B2D5_B2D57_MASK                          equ 0080h

// Register: B2D6
#define B2D6 B2D6
B2D6                                     equ 0376Ch
// bitfield definitions
B2D6_B2D6_POSN                           equ 0000h
B2D6_B2D6_POSITION                       equ 0000h
B2D6_B2D6_SIZE                           equ 0008h
B2D6_B2D6_LENGTH                         equ 0008h
B2D6_B2D6_MASK                           equ 00FFh
B2D6_B2D60_POSN                          equ 0000h
B2D6_B2D60_POSITION                      equ 0000h
B2D6_B2D60_SIZE                          equ 0001h
B2D6_B2D60_LENGTH                        equ 0001h
B2D6_B2D60_MASK                          equ 0001h
B2D6_B2D61_POSN                          equ 0001h
B2D6_B2D61_POSITION                      equ 0001h
B2D6_B2D61_SIZE                          equ 0001h
B2D6_B2D61_LENGTH                        equ 0001h
B2D6_B2D61_MASK                          equ 0002h
B2D6_B2D62_POSN                          equ 0002h
B2D6_B2D62_POSITION                      equ 0002h
B2D6_B2D62_SIZE                          equ 0001h
B2D6_B2D62_LENGTH                        equ 0001h
B2D6_B2D62_MASK                          equ 0004h
B2D6_B2D63_POSN                          equ 0003h
B2D6_B2D63_POSITION                      equ 0003h
B2D6_B2D63_SIZE                          equ 0001h
B2D6_B2D63_LENGTH                        equ 0001h
B2D6_B2D63_MASK                          equ 0008h
B2D6_B2D64_POSN                          equ 0004h
B2D6_B2D64_POSITION                      equ 0004h
B2D6_B2D64_SIZE                          equ 0001h
B2D6_B2D64_LENGTH                        equ 0001h
B2D6_B2D64_MASK                          equ 0010h
B2D6_B2D65_POSN                          equ 0005h
B2D6_B2D65_POSITION                      equ 0005h
B2D6_B2D65_SIZE                          equ 0001h
B2D6_B2D65_LENGTH                        equ 0001h
B2D6_B2D65_MASK                          equ 0020h
B2D6_B2D66_POSN                          equ 0006h
B2D6_B2D66_POSITION                      equ 0006h
B2D6_B2D66_SIZE                          equ 0001h
B2D6_B2D66_LENGTH                        equ 0001h
B2D6_B2D66_MASK                          equ 0040h
B2D6_B2D67_POSN                          equ 0007h
B2D6_B2D67_POSITION                      equ 0007h
B2D6_B2D67_SIZE                          equ 0001h
B2D6_B2D67_LENGTH                        equ 0001h
B2D6_B2D67_MASK                          equ 0080h

// Register: B2D7
#define B2D7 B2D7
B2D7                                     equ 0376Dh
// bitfield definitions
B2D7_B2D7_POSN                           equ 0000h
B2D7_B2D7_POSITION                       equ 0000h
B2D7_B2D7_SIZE                           equ 0008h
B2D7_B2D7_LENGTH                         equ 0008h
B2D7_B2D7_MASK                           equ 00FFh
B2D7_B2D70_POSN                          equ 0000h
B2D7_B2D70_POSITION                      equ 0000h
B2D7_B2D70_SIZE                          equ 0001h
B2D7_B2D70_LENGTH                        equ 0001h
B2D7_B2D70_MASK                          equ 0001h
B2D7_B2D71_POSN                          equ 0001h
B2D7_B2D71_POSITION                      equ 0001h
B2D7_B2D71_SIZE                          equ 0001h
B2D7_B2D71_LENGTH                        equ 0001h
B2D7_B2D71_MASK                          equ 0002h
B2D7_B2D72_POSN                          equ 0002h
B2D7_B2D72_POSITION                      equ 0002h
B2D7_B2D72_SIZE                          equ 0001h
B2D7_B2D72_LENGTH                        equ 0001h
B2D7_B2D72_MASK                          equ 0004h
B2D7_B2D73_POSN                          equ 0003h
B2D7_B2D73_POSITION                      equ 0003h
B2D7_B2D73_SIZE                          equ 0001h
B2D7_B2D73_LENGTH                        equ 0001h
B2D7_B2D73_MASK                          equ 0008h
B2D7_B2D74_POSN                          equ 0004h
B2D7_B2D74_POSITION                      equ 0004h
B2D7_B2D74_SIZE                          equ 0001h
B2D7_B2D74_LENGTH                        equ 0001h
B2D7_B2D74_MASK                          equ 0010h
B2D7_B2D75_POSN                          equ 0005h
B2D7_B2D75_POSITION                      equ 0005h
B2D7_B2D75_SIZE                          equ 0001h
B2D7_B2D75_LENGTH                        equ 0001h
B2D7_B2D75_MASK                          equ 0020h
B2D7_B2D76_POSN                          equ 0006h
B2D7_B2D76_POSITION                      equ 0006h
B2D7_B2D76_SIZE                          equ 0001h
B2D7_B2D76_LENGTH                        equ 0001h
B2D7_B2D76_MASK                          equ 0040h
B2D7_B2D77_POSN                          equ 0007h
B2D7_B2D77_POSITION                      equ 0007h
B2D7_B2D77_SIZE                          equ 0001h
B2D7_B2D77_LENGTH                        equ 0001h
B2D7_B2D77_MASK                          equ 0080h

// Register: CANSTAT_RO7
#define CANSTAT_RO7 CANSTAT_RO7
CANSTAT_RO7                              equ 0376Eh
// bitfield definitions
CANSTAT_RO7_EICODE0_POSN                 equ 0000h
CANSTAT_RO7_EICODE0_POSITION             equ 0000h
CANSTAT_RO7_EICODE0_SIZE                 equ 0001h
CANSTAT_RO7_EICODE0_LENGTH               equ 0001h
CANSTAT_RO7_EICODE0_MASK                 equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO7_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO7_EIDCODE2_ICODE1_POSN         equ 0002h
CANSTAT_RO7_EIDCODE2_ICODE1_POSITION     equ 0002h
CANSTAT_RO7_EIDCODE2_ICODE1_SIZE         equ 0001h
CANSTAT_RO7_EIDCODE2_ICODE1_LENGTH       equ 0001h
CANSTAT_RO7_EIDCODE2_ICODE1_MASK         equ 0004h
CANSTAT_RO7_EICODE3_ICOD2_POSN           equ 0003h
CANSTAT_RO7_EICODE3_ICOD2_POSITION       equ 0003h
CANSTAT_RO7_EICODE3_ICOD2_SIZE           equ 0001h
CANSTAT_RO7_EICODE3_ICOD2_LENGTH         equ 0001h
CANSTAT_RO7_EICODE3_ICOD2_MASK           equ 0008h
CANSTAT_RO7_EICODE4_POSN                 equ 0004h
CANSTAT_RO7_EICODE4_POSITION             equ 0004h
CANSTAT_RO7_EICODE4_SIZE                 equ 0001h
CANSTAT_RO7_EICODE4_LENGTH               equ 0001h
CANSTAT_RO7_EICODE4_MASK                 equ 0010h
CANSTAT_RO7_OPMODE_POSN                  equ 0005h
CANSTAT_RO7_OPMODE_POSITION              equ 0005h
CANSTAT_RO7_OPMODE_SIZE                  equ 0003h
CANSTAT_RO7_OPMODE_LENGTH                equ 0003h
CANSTAT_RO7_OPMODE_MASK                  equ 00E0h
CANSTAT_RO7_EICODE1_POSN                 equ 0001h
CANSTAT_RO7_EICODE1_POSITION             equ 0001h
CANSTAT_RO7_EICODE1_SIZE                 equ 0001h
CANSTAT_RO7_EICODE1_LENGTH               equ 0001h
CANSTAT_RO7_EICODE1_MASK                 equ 0002h
CANSTAT_RO7_EICODE2_POSN                 equ 0002h
CANSTAT_RO7_EICODE2_POSITION             equ 0002h
CANSTAT_RO7_EICODE2_SIZE                 equ 0001h
CANSTAT_RO7_EICODE2_LENGTH               equ 0001h
CANSTAT_RO7_EICODE2_MASK                 equ 0004h
CANSTAT_RO7_EICODE3_POSN                 equ 0003h
CANSTAT_RO7_EICODE3_POSITION             equ 0003h
CANSTAT_RO7_EICODE3_SIZE                 equ 0001h
CANSTAT_RO7_EICODE3_LENGTH               equ 0001h
CANSTAT_RO7_EICODE3_MASK                 equ 0008h
CANSTAT_RO7_OPMODE0_POSN                 equ 0005h
CANSTAT_RO7_OPMODE0_POSITION             equ 0005h
CANSTAT_RO7_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO7_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO7_OPMODE0_MASK                 equ 0020h
CANSTAT_RO7_OPMODE1_POSN                 equ 0006h
CANSTAT_RO7_OPMODE1_POSITION             equ 0006h
CANSTAT_RO7_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO7_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO7_OPMODE1_MASK                 equ 0040h
CANSTAT_RO7_OPMODE2_POSN                 equ 0007h
CANSTAT_RO7_OPMODE2_POSITION             equ 0007h
CANSTAT_RO7_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO7_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO7_OPMODE2_MASK                 equ 0080h
CANSTAT_RO7_ICODE0_POSN                  equ 0001h
CANSTAT_RO7_ICODE0_POSITION              equ 0001h
CANSTAT_RO7_ICODE0_SIZE                  equ 0001h
CANSTAT_RO7_ICODE0_LENGTH                equ 0001h
CANSTAT_RO7_ICODE0_MASK                  equ 0002h
CANSTAT_RO7_ICODE1_POSN                  equ 0002h
CANSTAT_RO7_ICODE1_POSITION              equ 0002h
CANSTAT_RO7_ICODE1_SIZE                  equ 0001h
CANSTAT_RO7_ICODE1_LENGTH                equ 0001h
CANSTAT_RO7_ICODE1_MASK                  equ 0004h
CANSTAT_RO7_ICODE2_POSN                  equ 0003h
CANSTAT_RO7_ICODE2_POSITION              equ 0003h
CANSTAT_RO7_ICODE2_SIZE                  equ 0001h
CANSTAT_RO7_ICODE2_LENGTH                equ 0001h
CANSTAT_RO7_ICODE2_MASK                  equ 0008h
CANSTAT_RO7_EICODE_POSN                  equ 0000h
CANSTAT_RO7_EICODE_POSITION              equ 0000h
CANSTAT_RO7_EICODE_SIZE                  equ 0005h
CANSTAT_RO7_EICODE_LENGTH                equ 0005h
CANSTAT_RO7_EICODE_MASK                  equ 001Fh
CANSTAT_RO7_ICODE_POSN                   equ 0001h
CANSTAT_RO7_ICODE_POSITION               equ 0001h
CANSTAT_RO7_ICODE_SIZE                   equ 0003h
CANSTAT_RO7_ICODE_LENGTH                 equ 0003h
CANSTAT_RO7_ICODE_MASK                   equ 000Eh

// Register: CANCON_RO7
#define CANCON_RO7 CANCON_RO7
CANCON_RO7                               equ 0376Fh
// bitfield definitions
CANCON_RO7_FP0_POSN                      equ 0000h
CANCON_RO7_FP0_POSITION                  equ 0000h
CANCON_RO7_FP0_SIZE                      equ 0001h
CANCON_RO7_FP0_LENGTH                    equ 0001h
CANCON_RO7_FP0_MASK                      equ 0001h
CANCON_RO7_WIN0_FP1_POSN                 equ 0001h
CANCON_RO7_WIN0_FP1_POSITION             equ 0001h
CANCON_RO7_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO7_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO7_WIN0_FP1_MASK                 equ 0002h
CANCON_RO7_WIN1_FP2_POSN                 equ 0002h
CANCON_RO7_WIN1_FP2_POSITION             equ 0002h
CANCON_RO7_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO7_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO7_WIN1_FP2_MASK                 equ 0004h
CANCON_RO7_WIN2_FP3_POSN                 equ 0003h
CANCON_RO7_WIN2_FP3_POSITION             equ 0003h
CANCON_RO7_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO7_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO7_WIN2_FP3_MASK                 equ 0008h
CANCON_RO7_ABAT_POSN                     equ 0004h
CANCON_RO7_ABAT_POSITION                 equ 0004h
CANCON_RO7_ABAT_SIZE                     equ 0001h
CANCON_RO7_ABAT_LENGTH                   equ 0001h
CANCON_RO7_ABAT_MASK                     equ 0010h
CANCON_RO7_REQOP_POSN                    equ 0005h
CANCON_RO7_REQOP_POSITION                equ 0005h
CANCON_RO7_REQOP_SIZE                    equ 0003h
CANCON_RO7_REQOP_LENGTH                  equ 0003h
CANCON_RO7_REQOP_MASK                    equ 00E0h
CANCON_RO7_WIN0_POSN                     equ 0001h
CANCON_RO7_WIN0_POSITION                 equ 0001h
CANCON_RO7_WIN0_SIZE                     equ 0001h
CANCON_RO7_WIN0_LENGTH                   equ 0001h
CANCON_RO7_WIN0_MASK                     equ 0002h
CANCON_RO7_WIN1_POSN                     equ 0002h
CANCON_RO7_WIN1_POSITION                 equ 0002h
CANCON_RO7_WIN1_SIZE                     equ 0001h
CANCON_RO7_WIN1_LENGTH                   equ 0001h
CANCON_RO7_WIN1_MASK                     equ 0004h
CANCON_RO7_WIN2_POSN                     equ 0003h
CANCON_RO7_WIN2_POSITION                 equ 0003h
CANCON_RO7_WIN2_SIZE                     equ 0001h
CANCON_RO7_WIN2_LENGTH                   equ 0001h
CANCON_RO7_WIN2_MASK                     equ 0008h
CANCON_RO7_REQOP0_POSN                   equ 0005h
CANCON_RO7_REQOP0_POSITION               equ 0005h
CANCON_RO7_REQOP0_SIZE                   equ 0001h
CANCON_RO7_REQOP0_LENGTH                 equ 0001h
CANCON_RO7_REQOP0_MASK                   equ 0020h
CANCON_RO7_REQOP1_POSN                   equ 0006h
CANCON_RO7_REQOP1_POSITION               equ 0006h
CANCON_RO7_REQOP1_SIZE                   equ 0001h
CANCON_RO7_REQOP1_LENGTH                 equ 0001h
CANCON_RO7_REQOP1_MASK                   equ 0040h
CANCON_RO7_REQOP2_POSN                   equ 0007h
CANCON_RO7_REQOP2_POSITION               equ 0007h
CANCON_RO7_REQOP2_SIZE                   equ 0001h
CANCON_RO7_REQOP2_LENGTH                 equ 0001h
CANCON_RO7_REQOP2_MASK                   equ 0080h
CANCON_RO7_FP1_POSN                      equ 0001h
CANCON_RO7_FP1_POSITION                  equ 0001h
CANCON_RO7_FP1_SIZE                      equ 0001h
CANCON_RO7_FP1_LENGTH                    equ 0001h
CANCON_RO7_FP1_MASK                      equ 0002h
CANCON_RO7_FP2_POSN                      equ 0002h
CANCON_RO7_FP2_POSITION                  equ 0002h
CANCON_RO7_FP2_SIZE                      equ 0001h
CANCON_RO7_FP2_LENGTH                    equ 0001h
CANCON_RO7_FP2_MASK                      equ 0004h
CANCON_RO7_FP3_POSN                      equ 0003h
CANCON_RO7_FP3_POSITION                  equ 0003h
CANCON_RO7_FP3_SIZE                      equ 0001h
CANCON_RO7_FP3_LENGTH                    equ 0001h
CANCON_RO7_FP3_MASK                      equ 0008h
CANCON_RO7_WIN_POSN                      equ 0001h
CANCON_RO7_WIN_POSITION                  equ 0001h
CANCON_RO7_WIN_SIZE                      equ 0003h
CANCON_RO7_WIN_LENGTH                    equ 0003h
CANCON_RO7_WIN_MASK                      equ 000Eh
CANCON_RO7_FP_POSN                       equ 0000h
CANCON_RO7_FP_POSITION                   equ 0000h
CANCON_RO7_FP_SIZE                       equ 0004h
CANCON_RO7_FP_LENGTH                     equ 0004h
CANCON_RO7_FP_MASK                       equ 000Fh

