GopalSaraf/Practicals/PSDL/include/proc/pic18f26k83.inc
// Register: TXB0CON
#define TXB0CON TXB0CON
TXB0CON                                  equ 037E0h
// bitfield definitions
TXB0CON_TXPRI_POSN                       equ 0000h
TXB0CON_TXPRI_POSITION                   equ 0000h
TXB0CON_TXPRI_SIZE                       equ 0002h
TXB0CON_TXPRI_LENGTH                     equ 0002h
TXB0CON_TXPRI_MASK                       equ 0003h
TXB0CON_TXREQ_POSN                       equ 0003h
TXB0CON_TXREQ_POSITION                   equ 0003h
TXB0CON_TXREQ_SIZE                       equ 0001h
TXB0CON_TXREQ_LENGTH                     equ 0001h
TXB0CON_TXREQ_MASK                       equ 0008h
TXB0CON_TXERR_POSN                       equ 0004h
TXB0CON_TXERR_POSITION                   equ 0004h
TXB0CON_TXERR_SIZE                       equ 0001h
TXB0CON_TXERR_LENGTH                     equ 0001h
TXB0CON_TXERR_MASK                       equ 0010h
TXB0CON_TXLARB_POSN                      equ 0005h
TXB0CON_TXLARB_POSITION                  equ 0005h
TXB0CON_TXLARB_SIZE                      equ 0001h
TXB0CON_TXLARB_LENGTH                    equ 0001h
TXB0CON_TXLARB_MASK                      equ 0020h
TXB0CON_TXABT_POSN                       equ 0006h
TXB0CON_TXABT_POSITION                   equ 0006h
TXB0CON_TXABT_SIZE                       equ 0001h
TXB0CON_TXABT_LENGTH                     equ 0001h
TXB0CON_TXABT_MASK                       equ 0040h
TXB0CON_TXBIF_POSN                       equ 0007h
TXB0CON_TXBIF_POSITION                   equ 0007h
TXB0CON_TXBIF_SIZE                       equ 0001h
TXB0CON_TXBIF_LENGTH                     equ 0001h
TXB0CON_TXBIF_MASK                       equ 0080h
TXB0CON_TXPRI0_POSN                      equ 0000h
TXB0CON_TXPRI0_POSITION                  equ 0000h
TXB0CON_TXPRI0_SIZE                      equ 0001h
TXB0CON_TXPRI0_LENGTH                    equ 0001h
TXB0CON_TXPRI0_MASK                      equ 0001h
TXB0CON_TXPRI1_POSN                      equ 0001h
TXB0CON_TXPRI1_POSITION                  equ 0001h
TXB0CON_TXPRI1_SIZE                      equ 0001h
TXB0CON_TXPRI1_LENGTH                    equ 0001h
TXB0CON_TXPRI1_MASK                      equ 0002h

// Register: TXB0SIDH
#define TXB0SIDH TXB0SIDH
TXB0SIDH                                 equ 037E1h
// bitfield definitions
TXB0SIDH_SID3_POSN                       equ 0000h
TXB0SIDH_SID3_POSITION                   equ 0000h
TXB0SIDH_SID3_SIZE                       equ 0001h
TXB0SIDH_SID3_LENGTH                     equ 0001h
TXB0SIDH_SID3_MASK                       equ 0001h
TXB0SIDH_SID4_POSN                       equ 0001h
TXB0SIDH_SID4_POSITION                   equ 0001h
TXB0SIDH_SID4_SIZE                       equ 0001h
TXB0SIDH_SID4_LENGTH                     equ 0001h
TXB0SIDH_SID4_MASK                       equ 0002h
TXB0SIDH_SID5_POSN                       equ 0002h
TXB0SIDH_SID5_POSITION                   equ 0002h
TXB0SIDH_SID5_SIZE                       equ 0001h
TXB0SIDH_SID5_LENGTH                     equ 0001h
TXB0SIDH_SID5_MASK                       equ 0004h
TXB0SIDH_SID6_POSN                       equ 0003h
TXB0SIDH_SID6_POSITION                   equ 0003h
TXB0SIDH_SID6_SIZE                       equ 0001h
TXB0SIDH_SID6_LENGTH                     equ 0001h
TXB0SIDH_SID6_MASK                       equ 0008h
TXB0SIDH_SID7_POSN                       equ 0004h
TXB0SIDH_SID7_POSITION                   equ 0004h
TXB0SIDH_SID7_SIZE                       equ 0001h
TXB0SIDH_SID7_LENGTH                     equ 0001h
TXB0SIDH_SID7_MASK                       equ 0010h
TXB0SIDH_SID8_POSN                       equ 0005h
TXB0SIDH_SID8_POSITION                   equ 0005h
TXB0SIDH_SID8_SIZE                       equ 0001h
TXB0SIDH_SID8_LENGTH                     equ 0001h
TXB0SIDH_SID8_MASK                       equ 0020h
TXB0SIDH_SID9_POSN                       equ 0006h
TXB0SIDH_SID9_POSITION                   equ 0006h
TXB0SIDH_SID9_SIZE                       equ 0001h
TXB0SIDH_SID9_LENGTH                     equ 0001h
TXB0SIDH_SID9_MASK                       equ 0040h
TXB0SIDH_SID10_POSN                      equ 0007h
TXB0SIDH_SID10_POSITION                  equ 0007h
TXB0SIDH_SID10_SIZE                      equ 0001h
TXB0SIDH_SID10_LENGTH                    equ 0001h
TXB0SIDH_SID10_MASK                      equ 0080h
TXB0SIDH_EID21_POSN                      equ 0000h
TXB0SIDH_EID21_POSITION                  equ 0000h
TXB0SIDH_EID21_SIZE                      equ 0001h
TXB0SIDH_EID21_LENGTH                    equ 0001h
TXB0SIDH_EID21_MASK                      equ 0001h
TXB0SIDH_EID22_POSN                      equ 0001h
TXB0SIDH_EID22_POSITION                  equ 0001h
TXB0SIDH_EID22_SIZE                      equ 0001h
TXB0SIDH_EID22_LENGTH                    equ 0001h
TXB0SIDH_EID22_MASK                      equ 0002h
TXB0SIDH_EID23_POSN                      equ 0002h
TXB0SIDH_EID23_POSITION                  equ 0002h
TXB0SIDH_EID23_SIZE                      equ 0001h
TXB0SIDH_EID23_LENGTH                    equ 0001h
TXB0SIDH_EID23_MASK                      equ 0004h
TXB0SIDH_EID24_POSN                      equ 0003h
TXB0SIDH_EID24_POSITION                  equ 0003h
TXB0SIDH_EID24_SIZE                      equ 0001h
TXB0SIDH_EID24_LENGTH                    equ 0001h
TXB0SIDH_EID24_MASK                      equ 0008h
TXB0SIDH_EID25_POSN                      equ 0004h
TXB0SIDH_EID25_POSITION                  equ 0004h
TXB0SIDH_EID25_SIZE                      equ 0001h
TXB0SIDH_EID25_LENGTH                    equ 0001h
TXB0SIDH_EID25_MASK                      equ 0010h
TXB0SIDH_EID26_POSN                      equ 0005h
TXB0SIDH_EID26_POSITION                  equ 0005h
TXB0SIDH_EID26_SIZE                      equ 0001h
TXB0SIDH_EID26_LENGTH                    equ 0001h
TXB0SIDH_EID26_MASK                      equ 0020h
TXB0SIDH_EID27_POSN                      equ 0006h
TXB0SIDH_EID27_POSITION                  equ 0006h
TXB0SIDH_EID27_SIZE                      equ 0001h
TXB0SIDH_EID27_LENGTH                    equ 0001h
TXB0SIDH_EID27_MASK                      equ 0040h
TXB0SIDH_EID28_POSN                      equ 0007h
TXB0SIDH_EID28_POSITION                  equ 0007h
TXB0SIDH_EID28_SIZE                      equ 0001h
TXB0SIDH_EID28_LENGTH                    equ 0001h
TXB0SIDH_EID28_MASK                      equ 0080h
TXB0SIDH_SID_POSN                        equ 0000h
TXB0SIDH_SID_POSITION                    equ 0000h
TXB0SIDH_SID_SIZE                        equ 0008h
TXB0SIDH_SID_LENGTH                      equ 0008h
TXB0SIDH_SID_MASK                        equ 00FFh

