GopalSaraf/Practicals/PSDL/include/proc/pic18f26k83.inc
// Register: RB2I2C
#define RB2I2C RB2I2C
RB2I2C                                   equ 03A5Bh
// bitfield definitions
RB2I2C_TH_POSN                           equ 0000h
RB2I2C_TH_POSITION                       equ 0000h
RB2I2C_TH_SIZE                           equ 0002h
RB2I2C_TH_LENGTH                         equ 0002h
RB2I2C_TH_MASK                           equ 0003h
RB2I2C_PU_POSN                           equ 0004h
RB2I2C_PU_POSITION                       equ 0004h
RB2I2C_PU_SIZE                           equ 0002h
RB2I2C_PU_LENGTH                         equ 0002h
RB2I2C_PU_MASK                           equ 0030h
RB2I2C_SLEW_POSN                         equ 0006h
RB2I2C_SLEW_POSITION                     equ 0006h
RB2I2C_SLEW_SIZE                         equ 0001h
RB2I2C_SLEW_LENGTH                       equ 0001h
RB2I2C_SLEW_MASK                         equ 0040h
RB2I2C_TH0_POSN                          equ 0000h
RB2I2C_TH0_POSITION                      equ 0000h
RB2I2C_TH0_SIZE                          equ 0001h
RB2I2C_TH0_LENGTH                        equ 0001h
RB2I2C_TH0_MASK                          equ 0001h
RB2I2C_TH1_POSN                          equ 0001h
RB2I2C_TH1_POSITION                      equ 0001h
RB2I2C_TH1_SIZE                          equ 0001h
RB2I2C_TH1_LENGTH                        equ 0001h
RB2I2C_TH1_MASK                          equ 0002h
RB2I2C_PU0_POSN                          equ 0004h
RB2I2C_PU0_POSITION                      equ 0004h
RB2I2C_PU0_SIZE                          equ 0001h
RB2I2C_PU0_LENGTH                        equ 0001h
RB2I2C_PU0_MASK                          equ 0010h
RB2I2C_PU1_POSN                          equ 0005h
RB2I2C_PU1_POSITION                      equ 0005h
RB2I2C_PU1_SIZE                          equ 0001h
RB2I2C_PU1_LENGTH                        equ 0001h
RB2I2C_PU1_MASK                          equ 0020h
RB2I2C_I2CTH_POSN                        equ 0000h
RB2I2C_I2CTH_POSITION                    equ 0000h
RB2I2C_I2CTH_SIZE                        equ 0002h
RB2I2C_I2CTH_LENGTH                      equ 0002h
RB2I2C_I2CTH_MASK                        equ 0003h
RB2I2C_I2CPU_POSN                        equ 0004h
RB2I2C_I2CPU_POSITION                    equ 0004h
RB2I2C_I2CPU_SIZE                        equ 0002h
RB2I2C_I2CPU_LENGTH                      equ 0002h
RB2I2C_I2CPU_MASK                        equ 0030h
RB2I2C_I2CSLEW_POSN                      equ 0006h
RB2I2C_I2CSLEW_POSITION                  equ 0006h
RB2I2C_I2CSLEW_SIZE                      equ 0001h
RB2I2C_I2CSLEW_LENGTH                    equ 0001h
RB2I2C_I2CSLEW_MASK                      equ 0040h
RB2I2C_I2CTH0_POSN                       equ 0000h
RB2I2C_I2CTH0_POSITION                   equ 0000h
RB2I2C_I2CTH0_SIZE                       equ 0001h
RB2I2C_I2CTH0_LENGTH                     equ 0001h
RB2I2C_I2CTH0_MASK                       equ 0001h
RB2I2C_I2CTH1_POSN                       equ 0001h
RB2I2C_I2CTH1_POSITION                   equ 0001h
RB2I2C_I2CTH1_SIZE                       equ 0001h
RB2I2C_I2CTH1_LENGTH                     equ 0001h
RB2I2C_I2CTH1_MASK                       equ 0002h
RB2I2C_I2CPU0_POSN                       equ 0004h
RB2I2C_I2CPU0_POSITION                   equ 0004h
RB2I2C_I2CPU0_SIZE                       equ 0001h
RB2I2C_I2CPU0_LENGTH                     equ 0001h
RB2I2C_I2CPU0_MASK                       equ 0010h
RB2I2C_I2CPU1_POSN                       equ 0005h
RB2I2C_I2CPU1_POSITION                   equ 0005h
RB2I2C_I2CPU1_SIZE                       equ 0001h
RB2I2C_I2CPU1_LENGTH                     equ 0001h
RB2I2C_I2CPU1_MASK                       equ 0020h

// Register: ANSELC
#define ANSELC ANSELC
ANSELC                                   equ 03A60h
// bitfield definitions
ANSELC_ANSELC0_POSN                      equ 0000h
ANSELC_ANSELC0_POSITION                  equ 0000h
ANSELC_ANSELC0_SIZE                      equ 0001h
ANSELC_ANSELC0_LENGTH                    equ 0001h
ANSELC_ANSELC0_MASK                      equ 0001h
ANSELC_ANSELC1_POSN                      equ 0001h
ANSELC_ANSELC1_POSITION                  equ 0001h
ANSELC_ANSELC1_SIZE                      equ 0001h
ANSELC_ANSELC1_LENGTH                    equ 0001h
ANSELC_ANSELC1_MASK                      equ 0002h
ANSELC_ANSELC2_POSN                      equ 0002h
ANSELC_ANSELC2_POSITION                  equ 0002h
ANSELC_ANSELC2_SIZE                      equ 0001h
ANSELC_ANSELC2_LENGTH                    equ 0001h
ANSELC_ANSELC2_MASK                      equ 0004h
ANSELC_ANSELC3_POSN                      equ 0003h
ANSELC_ANSELC3_POSITION                  equ 0003h
ANSELC_ANSELC3_SIZE                      equ 0001h
ANSELC_ANSELC3_LENGTH                    equ 0001h
ANSELC_ANSELC3_MASK                      equ 0008h
ANSELC_ANSELC4_POSN                      equ 0004h
ANSELC_ANSELC4_POSITION                  equ 0004h
ANSELC_ANSELC4_SIZE                      equ 0001h
ANSELC_ANSELC4_LENGTH                    equ 0001h
ANSELC_ANSELC4_MASK                      equ 0010h
ANSELC_ANSELC5_POSN                      equ 0005h
ANSELC_ANSELC5_POSITION                  equ 0005h
ANSELC_ANSELC5_SIZE                      equ 0001h
ANSELC_ANSELC5_LENGTH                    equ 0001h
ANSELC_ANSELC5_MASK                      equ 0020h
ANSELC_ANSELC6_POSN                      equ 0006h
ANSELC_ANSELC6_POSITION                  equ 0006h
ANSELC_ANSELC6_SIZE                      equ 0001h
ANSELC_ANSELC6_LENGTH                    equ 0001h
ANSELC_ANSELC6_MASK                      equ 0040h
ANSELC_ANSELC7_POSN                      equ 0007h
ANSELC_ANSELC7_POSITION                  equ 0007h
ANSELC_ANSELC7_SIZE                      equ 0001h
ANSELC_ANSELC7_LENGTH                    equ 0001h
ANSELC_ANSELC7_MASK                      equ 0080h

// Register: WPUC
#define WPUC WPUC
WPUC                                     equ 03A61h
// bitfield definitions
WPUC_WPUC0_POSN                          equ 0000h
WPUC_WPUC0_POSITION                      equ 0000h
WPUC_WPUC0_SIZE                          equ 0001h
WPUC_WPUC0_LENGTH                        equ 0001h
WPUC_WPUC0_MASK                          equ 0001h
WPUC_WPUC1_POSN                          equ 0001h
WPUC_WPUC1_POSITION                      equ 0001h
WPUC_WPUC1_SIZE                          equ 0001h
WPUC_WPUC1_LENGTH                        equ 0001h
WPUC_WPUC1_MASK                          equ 0002h
WPUC_WPUC2_POSN                          equ 0002h
WPUC_WPUC2_POSITION                      equ 0002h
WPUC_WPUC2_SIZE                          equ 0001h
WPUC_WPUC2_LENGTH                        equ 0001h
WPUC_WPUC2_MASK                          equ 0004h
WPUC_WPUC3_POSN                          equ 0003h
WPUC_WPUC3_POSITION                      equ 0003h
WPUC_WPUC3_SIZE                          equ 0001h
WPUC_WPUC3_LENGTH                        equ 0001h
WPUC_WPUC3_MASK                          equ 0008h
WPUC_WPUC4_POSN                          equ 0004h
WPUC_WPUC4_POSITION                      equ 0004h
WPUC_WPUC4_SIZE                          equ 0001h
WPUC_WPUC4_LENGTH                        equ 0001h
WPUC_WPUC4_MASK                          equ 0010h
WPUC_WPUC5_POSN                          equ 0005h
WPUC_WPUC5_POSITION                      equ 0005h
WPUC_WPUC5_SIZE                          equ 0001h
WPUC_WPUC5_LENGTH                        equ 0001h
WPUC_WPUC5_MASK                          equ 0020h
WPUC_WPUC6_POSN                          equ 0006h
WPUC_WPUC6_POSITION                      equ 0006h
WPUC_WPUC6_SIZE                          equ 0001h
WPUC_WPUC6_LENGTH                        equ 0001h
WPUC_WPUC6_MASK                          equ 0040h
WPUC_WPUC7_POSN                          equ 0007h
WPUC_WPUC7_POSITION                      equ 0007h
WPUC_WPUC7_SIZE                          equ 0001h
WPUC_WPUC7_LENGTH                        equ 0001h
WPUC_WPUC7_MASK                          equ 0080h

// Register: ODCONC
#define ODCONC ODCONC
ODCONC                                   equ 03A62h
// bitfield definitions
ODCONC_ODCC0_POSN                        equ 0000h
ODCONC_ODCC0_POSITION                    equ 0000h
ODCONC_ODCC0_SIZE                        equ 0001h
ODCONC_ODCC0_LENGTH                      equ 0001h
ODCONC_ODCC0_MASK                        equ 0001h
ODCONC_ODCC1_POSN                        equ 0001h
ODCONC_ODCC1_POSITION                    equ 0001h
ODCONC_ODCC1_SIZE                        equ 0001h
ODCONC_ODCC1_LENGTH                      equ 0001h
ODCONC_ODCC1_MASK                        equ 0002h
ODCONC_ODCC2_POSN                        equ 0002h
ODCONC_ODCC2_POSITION                    equ 0002h
ODCONC_ODCC2_SIZE                        equ 0001h
ODCONC_ODCC2_LENGTH                      equ 0001h
ODCONC_ODCC2_MASK                        equ 0004h
ODCONC_ODCC3_POSN                        equ 0003h
ODCONC_ODCC3_POSITION                    equ 0003h
ODCONC_ODCC3_SIZE                        equ 0001h
ODCONC_ODCC3_LENGTH                      equ 0001h
ODCONC_ODCC3_MASK                        equ 0008h
ODCONC_ODCC4_POSN                        equ 0004h
ODCONC_ODCC4_POSITION                    equ 0004h
ODCONC_ODCC4_SIZE                        equ 0001h
ODCONC_ODCC4_LENGTH                      equ 0001h
ODCONC_ODCC4_MASK                        equ 0010h
ODCONC_ODCC5_POSN                        equ 0005h
ODCONC_ODCC5_POSITION                    equ 0005h
ODCONC_ODCC5_SIZE                        equ 0001h
ODCONC_ODCC5_LENGTH                      equ 0001h
ODCONC_ODCC5_MASK                        equ 0020h
ODCONC_ODCC6_POSN                        equ 0006h
ODCONC_ODCC6_POSITION                    equ 0006h
ODCONC_ODCC6_SIZE                        equ 0001h
ODCONC_ODCC6_LENGTH                      equ 0001h
ODCONC_ODCC6_MASK                        equ 0040h
ODCONC_ODCC7_POSN                        equ 0007h
ODCONC_ODCC7_POSITION                    equ 0007h
ODCONC_ODCC7_SIZE                        equ 0001h
ODCONC_ODCC7_LENGTH                      equ 0001h
ODCONC_ODCC7_MASK                        equ 0080h

// Register: SLRCONC
#define SLRCONC SLRCONC
SLRCONC                                  equ 03A63h
// bitfield definitions
SLRCONC_SLRC0_POSN                       equ 0000h
SLRCONC_SLRC0_POSITION                   equ 0000h
SLRCONC_SLRC0_SIZE                       equ 0001h
SLRCONC_SLRC0_LENGTH                     equ 0001h
SLRCONC_SLRC0_MASK                       equ 0001h
SLRCONC_SLRC1_POSN                       equ 0001h
SLRCONC_SLRC1_POSITION                   equ 0001h
SLRCONC_SLRC1_SIZE                       equ 0001h
SLRCONC_SLRC1_LENGTH                     equ 0001h
SLRCONC_SLRC1_MASK                       equ 0002h
SLRCONC_SLRC2_POSN                       equ 0002h
SLRCONC_SLRC2_POSITION                   equ 0002h
SLRCONC_SLRC2_SIZE                       equ 0001h
SLRCONC_SLRC2_LENGTH                     equ 0001h
SLRCONC_SLRC2_MASK                       equ 0004h
SLRCONC_SLRC3_POSN                       equ 0003h
SLRCONC_SLRC3_POSITION                   equ 0003h
SLRCONC_SLRC3_SIZE                       equ 0001h
SLRCONC_SLRC3_LENGTH                     equ 0001h
SLRCONC_SLRC3_MASK                       equ 0008h
SLRCONC_SLRC4_POSN                       equ 0004h
SLRCONC_SLRC4_POSITION                   equ 0004h
SLRCONC_SLRC4_SIZE                       equ 0001h
SLRCONC_SLRC4_LENGTH                     equ 0001h
SLRCONC_SLRC4_MASK                       equ 0010h
SLRCONC_SLRC5_POSN                       equ 0005h
SLRCONC_SLRC5_POSITION                   equ 0005h
SLRCONC_SLRC5_SIZE                       equ 0001h
SLRCONC_SLRC5_LENGTH                     equ 0001h
SLRCONC_SLRC5_MASK                       equ 0020h
SLRCONC_SLRC6_POSN                       equ 0006h
SLRCONC_SLRC6_POSITION                   equ 0006h
SLRCONC_SLRC6_SIZE                       equ 0001h
SLRCONC_SLRC6_LENGTH                     equ 0001h
SLRCONC_SLRC6_MASK                       equ 0040h
SLRCONC_SLRC7_POSN                       equ 0007h
SLRCONC_SLRC7_POSITION                   equ 0007h
SLRCONC_SLRC7_SIZE                       equ 0001h
SLRCONC_SLRC7_LENGTH                     equ 0001h
SLRCONC_SLRC7_MASK                       equ 0080h

