GopalSaraf/Practicals/PSDL/include/proc/pic18f26k83.inc
// Register: DMA1DSZH
#define DMA1DSZH DMA1DSZH
DMA1DSZH                                 equ 03BEFh
// bitfield definitions
DMA1DSZH_DSZ_POSN                        equ 0000h
DMA1DSZH_DSZ_POSITION                    equ 0000h
DMA1DSZH_DSZ_SIZE                        equ 0004h
DMA1DSZH_DSZ_LENGTH                      equ 0004h
DMA1DSZH_DSZ_MASK                        equ 000Fh
DMA1DSZH_DMA1DSZ_POSN                    equ 0000h
DMA1DSZH_DMA1DSZ_POSITION                equ 0000h
DMA1DSZH_DMA1DSZ_SIZE                    equ 0004h
DMA1DSZH_DMA1DSZ_LENGTH                  equ 0004h
DMA1DSZH_DMA1DSZ_MASK                    equ 000Fh
DMA1DSZH_DSZ8_POSN                       equ 0000h
DMA1DSZH_DSZ8_POSITION                   equ 0000h
DMA1DSZH_DSZ8_SIZE                       equ 0001h
DMA1DSZH_DSZ8_LENGTH                     equ 0001h
DMA1DSZH_DSZ8_MASK                       equ 0001h
DMA1DSZH_DSZ9_POSN                       equ 0001h
DMA1DSZH_DSZ9_POSITION                   equ 0001h
DMA1DSZH_DSZ9_SIZE                       equ 0001h
DMA1DSZH_DSZ9_LENGTH                     equ 0001h
DMA1DSZH_DSZ9_MASK                       equ 0002h
DMA1DSZH_DSZ10_POSN                      equ 0002h
DMA1DSZH_DSZ10_POSITION                  equ 0002h
DMA1DSZH_DSZ10_SIZE                      equ 0001h
DMA1DSZH_DSZ10_LENGTH                    equ 0001h
DMA1DSZH_DSZ10_MASK                      equ 0004h
DMA1DSZH_DSZ11_POSN                      equ 0003h
DMA1DSZH_DSZ11_POSITION                  equ 0003h
DMA1DSZH_DSZ11_SIZE                      equ 0001h
DMA1DSZH_DSZ11_LENGTH                    equ 0001h
DMA1DSZH_DSZ11_MASK                      equ 0008h
DMA1DSZH_DMA1DSZ8_POSN                   equ 0000h
DMA1DSZH_DMA1DSZ8_POSITION               equ 0000h
DMA1DSZH_DMA1DSZ8_SIZE                   equ 0001h
DMA1DSZH_DMA1DSZ8_LENGTH                 equ 0001h
DMA1DSZH_DMA1DSZ8_MASK                   equ 0001h
DMA1DSZH_DMA1DSZ9_POSN                   equ 0001h
DMA1DSZH_DMA1DSZ9_POSITION               equ 0001h
DMA1DSZH_DMA1DSZ9_SIZE                   equ 0001h
DMA1DSZH_DMA1DSZ9_LENGTH                 equ 0001h
DMA1DSZH_DMA1DSZ9_MASK                   equ 0002h
DMA1DSZH_DMA1DSZ10_POSN                  equ 0002h
DMA1DSZH_DMA1DSZ10_POSITION              equ 0002h
DMA1DSZH_DMA1DSZ10_SIZE                  equ 0001h
DMA1DSZH_DMA1DSZ10_LENGTH                equ 0001h
DMA1DSZH_DMA1DSZ10_MASK                  equ 0004h
DMA1DSZH_DMA1DSZ11_POSN                  equ 0003h
DMA1DSZH_DMA1DSZ11_POSITION              equ 0003h
DMA1DSZH_DMA1DSZ11_SIZE                  equ 0001h
DMA1DSZH_DMA1DSZ11_LENGTH                equ 0001h
DMA1DSZH_DMA1DSZ11_MASK                  equ 0008h

// Register: DMA1DSA
#define DMA1DSA DMA1DSA
DMA1DSA                                  equ 03BF0h

// Register: DMA1DSAL
#define DMA1DSAL DMA1DSAL
DMA1DSAL                                 equ 03BF0h
// bitfield definitions
DMA1DSAL_DSA_POSN                        equ 0000h
DMA1DSAL_DSA_POSITION                    equ 0000h
DMA1DSAL_DSA_SIZE                        equ 0008h
DMA1DSAL_DSA_LENGTH                      equ 0008h
DMA1DSAL_DSA_MASK                        equ 00FFh
DMA1DSAL_DSA0_POSN                       equ 0000h
DMA1DSAL_DSA0_POSITION                   equ 0000h
DMA1DSAL_DSA0_SIZE                       equ 0001h
DMA1DSAL_DSA0_LENGTH                     equ 0001h
DMA1DSAL_DSA0_MASK                       equ 0001h
DMA1DSAL_DSA1_POSN                       equ 0001h
DMA1DSAL_DSA1_POSITION                   equ 0001h
DMA1DSAL_DSA1_SIZE                       equ 0001h
DMA1DSAL_DSA1_LENGTH                     equ 0001h
DMA1DSAL_DSA1_MASK                       equ 0002h
DMA1DSAL_DSA2_POSN                       equ 0002h
DMA1DSAL_DSA2_POSITION                   equ 0002h
DMA1DSAL_DSA2_SIZE                       equ 0001h
DMA1DSAL_DSA2_LENGTH                     equ 0001h
DMA1DSAL_DSA2_MASK                       equ 0004h
DMA1DSAL_DSA3_POSN                       equ 0003h
DMA1DSAL_DSA3_POSITION                   equ 0003h
DMA1DSAL_DSA3_SIZE                       equ 0001h
DMA1DSAL_DSA3_LENGTH                     equ 0001h
DMA1DSAL_DSA3_MASK                       equ 0008h
DMA1DSAL_DSA4_POSN                       equ 0004h
DMA1DSAL_DSA4_POSITION                   equ 0004h
DMA1DSAL_DSA4_SIZE                       equ 0001h
DMA1DSAL_DSA4_LENGTH                     equ 0001h
DMA1DSAL_DSA4_MASK                       equ 0010h
DMA1DSAL_DSA5_POSN                       equ 0005h
DMA1DSAL_DSA5_POSITION                   equ 0005h
DMA1DSAL_DSA5_SIZE                       equ 0001h
DMA1DSAL_DSA5_LENGTH                     equ 0001h
DMA1DSAL_DSA5_MASK                       equ 0020h
DMA1DSAL_DSA6_POSN                       equ 0006h
DMA1DSAL_DSA6_POSITION                   equ 0006h
DMA1DSAL_DSA6_SIZE                       equ 0001h
DMA1DSAL_DSA6_LENGTH                     equ 0001h
DMA1DSAL_DSA6_MASK                       equ 0040h
DMA1DSAL_DSA7_POSN                       equ 0007h
DMA1DSAL_DSA7_POSITION                   equ 0007h
DMA1DSAL_DSA7_SIZE                       equ 0001h
DMA1DSAL_DSA7_LENGTH                     equ 0001h
DMA1DSAL_DSA7_MASK                       equ 0080h
DMA1DSAL_DMA1DSA_POSN                    equ 0000h
DMA1DSAL_DMA1DSA_POSITION                equ 0000h
DMA1DSAL_DMA1DSA_SIZE                    equ 0008h
DMA1DSAL_DMA1DSA_LENGTH                  equ 0008h
DMA1DSAL_DMA1DSA_MASK                    equ 00FFh
DMA1DSAL_DMA1DSA0_POSN                   equ 0000h
DMA1DSAL_DMA1DSA0_POSITION               equ 0000h
DMA1DSAL_DMA1DSA0_SIZE                   equ 0001h
DMA1DSAL_DMA1DSA0_LENGTH                 equ 0001h
DMA1DSAL_DMA1DSA0_MASK                   equ 0001h
DMA1DSAL_DMA1DSA1_POSN                   equ 0001h
DMA1DSAL_DMA1DSA1_POSITION               equ 0001h
DMA1DSAL_DMA1DSA1_SIZE                   equ 0001h
DMA1DSAL_DMA1DSA1_LENGTH                 equ 0001h
DMA1DSAL_DMA1DSA1_MASK                   equ 0002h
DMA1DSAL_DMA1DSA2_POSN                   equ 0002h
DMA1DSAL_DMA1DSA2_POSITION               equ 0002h
DMA1DSAL_DMA1DSA2_SIZE                   equ 0001h
DMA1DSAL_DMA1DSA2_LENGTH                 equ 0001h
DMA1DSAL_DMA1DSA2_MASK                   equ 0004h
DMA1DSAL_DMA1DSA3_POSN                   equ 0003h
DMA1DSAL_DMA1DSA3_POSITION               equ 0003h
DMA1DSAL_DMA1DSA3_SIZE                   equ 0001h
DMA1DSAL_DMA1DSA3_LENGTH                 equ 0001h
DMA1DSAL_DMA1DSA3_MASK                   equ 0008h
DMA1DSAL_DMA1DSA4_POSN                   equ 0004h
DMA1DSAL_DMA1DSA4_POSITION               equ 0004h
DMA1DSAL_DMA1DSA4_SIZE                   equ 0001h
DMA1DSAL_DMA1DSA4_LENGTH                 equ 0001h
DMA1DSAL_DMA1DSA4_MASK                   equ 0010h
DMA1DSAL_DMA1DSA5_POSN                   equ 0005h
DMA1DSAL_DMA1DSA5_POSITION               equ 0005h
DMA1DSAL_DMA1DSA5_SIZE                   equ 0001h
DMA1DSAL_DMA1DSA5_LENGTH                 equ 0001h
DMA1DSAL_DMA1DSA5_MASK                   equ 0020h
DMA1DSAL_DMA1DSA6_POSN                   equ 0006h
DMA1DSAL_DMA1DSA6_POSITION               equ 0006h
DMA1DSAL_DMA1DSA6_SIZE                   equ 0001h
DMA1DSAL_DMA1DSA6_LENGTH                 equ 0001h
DMA1DSAL_DMA1DSA6_MASK                   equ 0040h
DMA1DSAL_DMA1DSA7_POSN                   equ 0007h
DMA1DSAL_DMA1DSA7_POSITION               equ 0007h
DMA1DSAL_DMA1DSA7_SIZE                   equ 0001h
DMA1DSAL_DMA1DSA7_LENGTH                 equ 0001h
DMA1DSAL_DMA1DSA7_MASK                   equ 0080h

