GopalSaraf/Practicals/PSDL/include/proc/pic18f26k83.inc
// Register: RXB0SIDL
#define RXB0SIDL RXB0SIDL
RXB0SIDL                                 equ 03F82h
// bitfield definitions
RXB0SIDL_EID16_POSN                      equ 0000h
RXB0SIDL_EID16_POSITION                  equ 0000h
RXB0SIDL_EID16_SIZE                      equ 0001h
RXB0SIDL_EID16_LENGTH                    equ 0001h
RXB0SIDL_EID16_MASK                      equ 0001h
RXB0SIDL_EID17_POSN                      equ 0001h
RXB0SIDL_EID17_POSITION                  equ 0001h
RXB0SIDL_EID17_SIZE                      equ 0001h
RXB0SIDL_EID17_LENGTH                    equ 0001h
RXB0SIDL_EID17_MASK                      equ 0002h
RXB0SIDL_EXID_POSN                       equ 0003h
RXB0SIDL_EXID_POSITION                   equ 0003h
RXB0SIDL_EXID_SIZE                       equ 0001h
RXB0SIDL_EXID_LENGTH                     equ 0001h
RXB0SIDL_EXID_MASK                       equ 0008h
RXB0SIDL_SRR_POSN                        equ 0004h
RXB0SIDL_SRR_POSITION                    equ 0004h
RXB0SIDL_SRR_SIZE                        equ 0001h
RXB0SIDL_SRR_LENGTH                      equ 0001h
RXB0SIDL_SRR_MASK                        equ 0010h
RXB0SIDL_SID0_POSN                       equ 0005h
RXB0SIDL_SID0_POSITION                   equ 0005h
RXB0SIDL_SID0_SIZE                       equ 0001h
RXB0SIDL_SID0_LENGTH                     equ 0001h
RXB0SIDL_SID0_MASK                       equ 0020h
RXB0SIDL_SID1_POSN                       equ 0006h
RXB0SIDL_SID1_POSITION                   equ 0006h
RXB0SIDL_SID1_SIZE                       equ 0001h
RXB0SIDL_SID1_LENGTH                     equ 0001h
RXB0SIDL_SID1_MASK                       equ 0040h
RXB0SIDL_SID2_POSN                       equ 0007h
RXB0SIDL_SID2_POSITION                   equ 0007h
RXB0SIDL_SID2_SIZE                       equ 0001h
RXB0SIDL_SID2_LENGTH                     equ 0001h
RXB0SIDL_SID2_MASK                       equ 0080h
RXB0SIDL_EID18_POSN                      equ 0005h
RXB0SIDL_EID18_POSITION                  equ 0005h
RXB0SIDL_EID18_SIZE                      equ 0001h
RXB0SIDL_EID18_LENGTH                    equ 0001h
RXB0SIDL_EID18_MASK                      equ 0020h
RXB0SIDL_EID19_POSN                      equ 0006h
RXB0SIDL_EID19_POSITION                  equ 0006h
RXB0SIDL_EID19_SIZE                      equ 0001h
RXB0SIDL_EID19_LENGTH                    equ 0001h
RXB0SIDL_EID19_MASK                      equ 0040h
RXB0SIDL_EID20_POSN                      equ 0007h
RXB0SIDL_EID20_POSITION                  equ 0007h
RXB0SIDL_EID20_SIZE                      equ 0001h
RXB0SIDL_EID20_LENGTH                    equ 0001h
RXB0SIDL_EID20_MASK                      equ 0080h
RXB0SIDL_EID_POSN                        equ 0000h
RXB0SIDL_EID_POSITION                    equ 0000h
RXB0SIDL_EID_SIZE                        equ 0002h
RXB0SIDL_EID_LENGTH                      equ 0002h
RXB0SIDL_EID_MASK                        equ 0003h
RXB0SIDL_SID_POSN                        equ 0005h
RXB0SIDL_SID_POSITION                    equ 0005h
RXB0SIDL_SID_SIZE                        equ 0003h
RXB0SIDL_SID_LENGTH                      equ 0003h
RXB0SIDL_SID_MASK                        equ 00E0h

// Register: RXB0EIDH
#define RXB0EIDH RXB0EIDH
RXB0EIDH                                 equ 03F83h
// bitfield definitions
RXB0EIDH_EID8_POSN                       equ 0000h
RXB0EIDH_EID8_POSITION                   equ 0000h
RXB0EIDH_EID8_SIZE                       equ 0001h
RXB0EIDH_EID8_LENGTH                     equ 0001h
RXB0EIDH_EID8_MASK                       equ 0001h
RXB0EIDH_EID9_POSN                       equ 0001h
RXB0EIDH_EID9_POSITION                   equ 0001h
RXB0EIDH_EID9_SIZE                       equ 0001h
RXB0EIDH_EID9_LENGTH                     equ 0001h
RXB0EIDH_EID9_MASK                       equ 0002h
RXB0EIDH_EID10_POSN                      equ 0002h
RXB0EIDH_EID10_POSITION                  equ 0002h
RXB0EIDH_EID10_SIZE                      equ 0001h
RXB0EIDH_EID10_LENGTH                    equ 0001h
RXB0EIDH_EID10_MASK                      equ 0004h
RXB0EIDH_EID11_POSN                      equ 0003h
RXB0EIDH_EID11_POSITION                  equ 0003h
RXB0EIDH_EID11_SIZE                      equ 0001h
RXB0EIDH_EID11_LENGTH                    equ 0001h
RXB0EIDH_EID11_MASK                      equ 0008h
RXB0EIDH_EID12_POSN                      equ 0004h
RXB0EIDH_EID12_POSITION                  equ 0004h
RXB0EIDH_EID12_SIZE                      equ 0001h
RXB0EIDH_EID12_LENGTH                    equ 0001h
RXB0EIDH_EID12_MASK                      equ 0010h
RXB0EIDH_EID13_POSN                      equ 0005h
RXB0EIDH_EID13_POSITION                  equ 0005h
RXB0EIDH_EID13_SIZE                      equ 0001h
RXB0EIDH_EID13_LENGTH                    equ 0001h
RXB0EIDH_EID13_MASK                      equ 0020h
RXB0EIDH_EID14_POSN                      equ 0006h
RXB0EIDH_EID14_POSITION                  equ 0006h
RXB0EIDH_EID14_SIZE                      equ 0001h
RXB0EIDH_EID14_LENGTH                    equ 0001h
RXB0EIDH_EID14_MASK                      equ 0040h
RXB0EIDH_EID15_POSN                      equ 0007h
RXB0EIDH_EID15_POSITION                  equ 0007h
RXB0EIDH_EID15_SIZE                      equ 0001h
RXB0EIDH_EID15_LENGTH                    equ 0001h
RXB0EIDH_EID15_MASK                      equ 0080h
RXB0EIDH_EID_POSN                        equ 0000h
RXB0EIDH_EID_POSITION                    equ 0000h
RXB0EIDH_EID_SIZE                        equ 0008h
RXB0EIDH_EID_LENGTH                      equ 0008h
RXB0EIDH_EID_MASK                        equ 00FFh

// Register: RXB0EIDL
#define RXB0EIDL RXB0EIDL
RXB0EIDL                                 equ 03F84h
// bitfield definitions
RXB0EIDL_EID0_POSN                       equ 0000h
RXB0EIDL_EID0_POSITION                   equ 0000h
RXB0EIDL_EID0_SIZE                       equ 0001h
RXB0EIDL_EID0_LENGTH                     equ 0001h
RXB0EIDL_EID0_MASK                       equ 0001h
RXB0EIDL_EID1_POSN                       equ 0001h
RXB0EIDL_EID1_POSITION                   equ 0001h
RXB0EIDL_EID1_SIZE                       equ 0001h
RXB0EIDL_EID1_LENGTH                     equ 0001h
RXB0EIDL_EID1_MASK                       equ 0002h
RXB0EIDL_EID2_POSN                       equ 0002h
RXB0EIDL_EID2_POSITION                   equ 0002h
RXB0EIDL_EID2_SIZE                       equ 0001h
RXB0EIDL_EID2_LENGTH                     equ 0001h
RXB0EIDL_EID2_MASK                       equ 0004h
RXB0EIDL_EID3_POSN                       equ 0003h
RXB0EIDL_EID3_POSITION                   equ 0003h
RXB0EIDL_EID3_SIZE                       equ 0001h
RXB0EIDL_EID3_LENGTH                     equ 0001h
RXB0EIDL_EID3_MASK                       equ 0008h
RXB0EIDL_EID4_POSN                       equ 0004h
RXB0EIDL_EID4_POSITION                   equ 0004h
RXB0EIDL_EID4_SIZE                       equ 0001h
RXB0EIDL_EID4_LENGTH                     equ 0001h
RXB0EIDL_EID4_MASK                       equ 0010h
RXB0EIDL_EID5_POSN                       equ 0005h
RXB0EIDL_EID5_POSITION                   equ 0005h
RXB0EIDL_EID5_SIZE                       equ 0001h
RXB0EIDL_EID5_LENGTH                     equ 0001h
RXB0EIDL_EID5_MASK                       equ 0020h
RXB0EIDL_EID6_POSN                       equ 0006h
RXB0EIDL_EID6_POSITION                   equ 0006h
RXB0EIDL_EID6_SIZE                       equ 0001h
RXB0EIDL_EID6_LENGTH                     equ 0001h
RXB0EIDL_EID6_MASK                       equ 0040h
RXB0EIDL_EID7_POSN                       equ 0007h
RXB0EIDL_EID7_POSITION                   equ 0007h
RXB0EIDL_EID7_SIZE                       equ 0001h
RXB0EIDL_EID7_LENGTH                     equ 0001h
RXB0EIDL_EID7_MASK                       equ 0080h
RXB0EIDL_EID_POSN                        equ 0000h
RXB0EIDL_EID_POSITION                    equ 0000h
RXB0EIDL_EID_SIZE                        equ 0008h
RXB0EIDL_EID_LENGTH                      equ 0008h
RXB0EIDL_EID_MASK                        equ 00FFh

// Register: RXB0DLC
#define RXB0DLC RXB0DLC
RXB0DLC                                  equ 03F85h
// bitfield definitions
RXB0DLC_DLC_POSN                         equ 0000h
RXB0DLC_DLC_POSITION                     equ 0000h
RXB0DLC_DLC_SIZE                         equ 0004h
RXB0DLC_DLC_LENGTH                       equ 0004h
RXB0DLC_DLC_MASK                         equ 000Fh
RXB0DLC_RB_POSN                          equ 0004h
RXB0DLC_RB_POSITION                      equ 0004h
RXB0DLC_RB_SIZE                          equ 0002h
RXB0DLC_RB_LENGTH                        equ 0002h
RXB0DLC_RB_MASK                          equ 0030h
RXB0DLC_RXRTR_POSN                       equ 0006h
RXB0DLC_RXRTR_POSITION                   equ 0006h
RXB0DLC_RXRTR_SIZE                       equ 0001h
RXB0DLC_RXRTR_LENGTH                     equ 0001h
RXB0DLC_RXRTR_MASK                       equ 0040h
RXB0DLC_DLC0_POSN                        equ 0000h
RXB0DLC_DLC0_POSITION                    equ 0000h
RXB0DLC_DLC0_SIZE                        equ 0001h
RXB0DLC_DLC0_LENGTH                      equ 0001h
RXB0DLC_DLC0_MASK                        equ 0001h
RXB0DLC_DLC1_POSN                        equ 0001h
RXB0DLC_DLC1_POSITION                    equ 0001h
RXB0DLC_DLC1_SIZE                        equ 0001h
RXB0DLC_DLC1_LENGTH                      equ 0001h
RXB0DLC_DLC1_MASK                        equ 0002h
RXB0DLC_DLC2_POSN                        equ 0002h
RXB0DLC_DLC2_POSITION                    equ 0002h
RXB0DLC_DLC2_SIZE                        equ 0001h
RXB0DLC_DLC2_LENGTH                      equ 0001h
RXB0DLC_DLC2_MASK                        equ 0004h
RXB0DLC_DLC3_POSN                        equ 0003h
RXB0DLC_DLC3_POSITION                    equ 0003h
RXB0DLC_DLC3_SIZE                        equ 0001h
RXB0DLC_DLC3_LENGTH                      equ 0001h
RXB0DLC_DLC3_MASK                        equ 0008h
RXB0DLC_RB0_POSN                         equ 0004h
RXB0DLC_RB0_POSITION                     equ 0004h
RXB0DLC_RB0_SIZE                         equ 0001h
RXB0DLC_RB0_LENGTH                       equ 0001h
RXB0DLC_RB0_MASK                         equ 0010h
RXB0DLC_RB1_POSN                         equ 0005h
RXB0DLC_RB1_POSITION                     equ 0005h
RXB0DLC_RB1_SIZE                         equ 0001h
RXB0DLC_RB1_LENGTH                       equ 0001h
RXB0DLC_RB1_MASK                         equ 0020h
RXB0DLC_RXB0DLC0_POSN                    equ 0000h
RXB0DLC_RXB0DLC0_POSITION                equ 0000h
RXB0DLC_RXB0DLC0_SIZE                    equ 0001h
RXB0DLC_RXB0DLC0_LENGTH                  equ 0001h
RXB0DLC_RXB0DLC0_MASK                    equ 0001h
RXB0DLC_RXB0DLC1_POSN                    equ 0001h
RXB0DLC_RXB0DLC1_POSITION                equ 0001h
RXB0DLC_RXB0DLC1_SIZE                    equ 0001h
RXB0DLC_RXB0DLC1_LENGTH                  equ 0001h
RXB0DLC_RXB0DLC1_MASK                    equ 0002h
RXB0DLC_RXB0DLC2_POSN                    equ 0002h
RXB0DLC_RXB0DLC2_POSITION                equ 0002h
RXB0DLC_RXB0DLC2_SIZE                    equ 0001h
RXB0DLC_RXB0DLC2_LENGTH                  equ 0001h
RXB0DLC_RXB0DLC2_MASK                    equ 0004h
RXB0DLC_RXB0DLC3_POSN                    equ 0003h
RXB0DLC_RXB0DLC3_POSITION                equ 0003h
RXB0DLC_RXB0DLC3_SIZE                    equ 0001h
RXB0DLC_RXB0DLC3_LENGTH                  equ 0001h
RXB0DLC_RXB0DLC3_MASK                    equ 0008h
RXB0DLC_RXB0RB0_POSN                     equ 0004h
RXB0DLC_RXB0RB0_POSITION                 equ 0004h
RXB0DLC_RXB0RB0_SIZE                     equ 0001h
RXB0DLC_RXB0RB0_LENGTH                   equ 0001h
RXB0DLC_RXB0RB0_MASK                     equ 0010h
RXB0DLC_RXB0RB1_POSN                     equ 0005h
RXB0DLC_RXB0RB1_POSITION                 equ 0005h
RXB0DLC_RXB0RB1_SIZE                     equ 0001h
RXB0DLC_RXB0RB1_LENGTH                   equ 0001h
RXB0DLC_RXB0RB1_MASK                     equ 0020h
RXB0DLC_RXB0RTR_POSN                     equ 0006h
RXB0DLC_RXB0RTR_POSITION                 equ 0006h
RXB0DLC_RXB0RTR_SIZE                     equ 0001h
RXB0DLC_RXB0RTR_LENGTH                   equ 0001h
RXB0DLC_RXB0RTR_MASK                     equ 0040h

// Register: RXB0D0
#define RXB0D0 RXB0D0
RXB0D0                                   equ 03F86h
// bitfield definitions
RXB0D0_RXB0D0_POSN                       equ 0000h
RXB0D0_RXB0D0_POSITION                   equ 0000h
RXB0D0_RXB0D0_SIZE                       equ 0008h
RXB0D0_RXB0D0_LENGTH                     equ 0008h
RXB0D0_RXB0D0_MASK                       equ 00FFh
RXB0D0_RXB0D00_POSN                      equ 0000h
RXB0D0_RXB0D00_POSITION                  equ 0000h
RXB0D0_RXB0D00_SIZE                      equ 0001h
RXB0D0_RXB0D00_LENGTH                    equ 0001h
RXB0D0_RXB0D00_MASK                      equ 0001h
RXB0D0_RXB0D01_POSN                      equ 0001h
RXB0D0_RXB0D01_POSITION                  equ 0001h
RXB0D0_RXB0D01_SIZE                      equ 0001h
RXB0D0_RXB0D01_LENGTH                    equ 0001h
RXB0D0_RXB0D01_MASK                      equ 0002h
RXB0D0_RXB0D02_POSN                      equ 0002h
RXB0D0_RXB0D02_POSITION                  equ 0002h
RXB0D0_RXB0D02_SIZE                      equ 0001h
RXB0D0_RXB0D02_LENGTH                    equ 0001h
RXB0D0_RXB0D02_MASK                      equ 0004h
RXB0D0_RXB0D03_POSN                      equ 0003h
RXB0D0_RXB0D03_POSITION                  equ 0003h
RXB0D0_RXB0D03_SIZE                      equ 0001h
RXB0D0_RXB0D03_LENGTH                    equ 0001h
RXB0D0_RXB0D03_MASK                      equ 0008h
RXB0D0_RXB0D04_POSN                      equ 0004h
RXB0D0_RXB0D04_POSITION                  equ 0004h
RXB0D0_RXB0D04_SIZE                      equ 0001h
RXB0D0_RXB0D04_LENGTH                    equ 0001h
RXB0D0_RXB0D04_MASK                      equ 0010h
RXB0D0_RXB0D05_POSN                      equ 0005h
RXB0D0_RXB0D05_POSITION                  equ 0005h
RXB0D0_RXB0D05_SIZE                      equ 0001h
RXB0D0_RXB0D05_LENGTH                    equ 0001h
RXB0D0_RXB0D05_MASK                      equ 0020h
RXB0D0_RXB0D06_POSN                      equ 0006h
RXB0D0_RXB0D06_POSITION                  equ 0006h
RXB0D0_RXB0D06_SIZE                      equ 0001h
RXB0D0_RXB0D06_LENGTH                    equ 0001h
RXB0D0_RXB0D06_MASK                      equ 0040h
RXB0D0_RXB0D07_POSN                      equ 0007h
RXB0D0_RXB0D07_POSITION                  equ 0007h
RXB0D0_RXB0D07_SIZE                      equ 0001h
RXB0D0_RXB0D07_LENGTH                    equ 0001h
RXB0D0_RXB0D07_MASK                      equ 0080h

// Register: RXB0D1
#define RXB0D1 RXB0D1
RXB0D1                                   equ 03F87h
// bitfield definitions
RXB0D1_RXB0D1_POSN                       equ 0000h
RXB0D1_RXB0D1_POSITION                   equ 0000h
RXB0D1_RXB0D1_SIZE                       equ 0008h
RXB0D1_RXB0D1_LENGTH                     equ 0008h
RXB0D1_RXB0D1_MASK                       equ 00FFh
RXB0D1_RXB0D10_POSN                      equ 0000h
RXB0D1_RXB0D10_POSITION                  equ 0000h
RXB0D1_RXB0D10_SIZE                      equ 0001h
RXB0D1_RXB0D10_LENGTH                    equ 0001h
RXB0D1_RXB0D10_MASK                      equ 0001h
RXB0D1_RXB0D11_POSN                      equ 0001h
RXB0D1_RXB0D11_POSITION                  equ 0001h
RXB0D1_RXB0D11_SIZE                      equ 0001h
RXB0D1_RXB0D11_LENGTH                    equ 0001h
RXB0D1_RXB0D11_MASK                      equ 0002h
RXB0D1_RXB0D12_POSN                      equ 0002h
RXB0D1_RXB0D12_POSITION                  equ 0002h
RXB0D1_RXB0D12_SIZE                      equ 0001h
RXB0D1_RXB0D12_LENGTH                    equ 0001h
RXB0D1_RXB0D12_MASK                      equ 0004h
RXB0D1_RXB0D13_POSN                      equ 0003h
RXB0D1_RXB0D13_POSITION                  equ 0003h
RXB0D1_RXB0D13_SIZE                      equ 0001h
RXB0D1_RXB0D13_LENGTH                    equ 0001h
RXB0D1_RXB0D13_MASK                      equ 0008h
RXB0D1_RXB0D14_POSN                      equ 0004h
RXB0D1_RXB0D14_POSITION                  equ 0004h
RXB0D1_RXB0D14_SIZE                      equ 0001h
RXB0D1_RXB0D14_LENGTH                    equ 0001h
RXB0D1_RXB0D14_MASK                      equ 0010h
RXB0D1_RXB0D15_POSN                      equ 0005h
RXB0D1_RXB0D15_POSITION                  equ 0005h
RXB0D1_RXB0D15_SIZE                      equ 0001h
RXB0D1_RXB0D15_LENGTH                    equ 0001h
RXB0D1_RXB0D15_MASK                      equ 0020h
RXB0D1_RXB0D16_POSN                      equ 0006h
RXB0D1_RXB0D16_POSITION                  equ 0006h
RXB0D1_RXB0D16_SIZE                      equ 0001h
RXB0D1_RXB0D16_LENGTH                    equ 0001h
RXB0D1_RXB0D16_MASK                      equ 0040h
RXB0D1_RXB0D17_POSN                      equ 0007h
RXB0D1_RXB0D17_POSITION                  equ 0007h
RXB0D1_RXB0D17_SIZE                      equ 0001h
RXB0D1_RXB0D17_LENGTH                    equ 0001h
RXB0D1_RXB0D17_MASK                      equ 0080h

// Register: RXB0D2
#define RXB0D2 RXB0D2
RXB0D2                                   equ 03F88h
// bitfield definitions
RXB0D2_RXB0D2_POSN                       equ 0000h
RXB0D2_RXB0D2_POSITION                   equ 0000h
RXB0D2_RXB0D2_SIZE                       equ 0008h
RXB0D2_RXB0D2_LENGTH                     equ 0008h
RXB0D2_RXB0D2_MASK                       equ 00FFh
RXB0D2_RXB0D20_POSN                      equ 0000h
RXB0D2_RXB0D20_POSITION                  equ 0000h
RXB0D2_RXB0D20_SIZE                      equ 0001h
RXB0D2_RXB0D20_LENGTH                    equ 0001h
RXB0D2_RXB0D20_MASK                      equ 0001h
RXB0D2_RXB0D21_POSN                      equ 0001h
RXB0D2_RXB0D21_POSITION                  equ 0001h
RXB0D2_RXB0D21_SIZE                      equ 0001h
RXB0D2_RXB0D21_LENGTH                    equ 0001h
RXB0D2_RXB0D21_MASK                      equ 0002h
RXB0D2_RXB0D22_POSN                      equ 0002h
RXB0D2_RXB0D22_POSITION                  equ 0002h
RXB0D2_RXB0D22_SIZE                      equ 0001h
RXB0D2_RXB0D22_LENGTH                    equ 0001h
RXB0D2_RXB0D22_MASK                      equ 0004h
RXB0D2_RXB0D23_POSN                      equ 0003h
RXB0D2_RXB0D23_POSITION                  equ 0003h
RXB0D2_RXB0D23_SIZE                      equ 0001h
RXB0D2_RXB0D23_LENGTH                    equ 0001h
RXB0D2_RXB0D23_MASK                      equ 0008h
RXB0D2_RXB0D24_POSN                      equ 0004h
RXB0D2_RXB0D24_POSITION                  equ 0004h
RXB0D2_RXB0D24_SIZE                      equ 0001h
RXB0D2_RXB0D24_LENGTH                    equ 0001h
RXB0D2_RXB0D24_MASK                      equ 0010h
RXB0D2_RXB0D25_POSN                      equ 0005h
RXB0D2_RXB0D25_POSITION                  equ 0005h
RXB0D2_RXB0D25_SIZE                      equ 0001h
RXB0D2_RXB0D25_LENGTH                    equ 0001h
RXB0D2_RXB0D25_MASK                      equ 0020h
RXB0D2_RXB0D26_POSN                      equ 0006h
RXB0D2_RXB0D26_POSITION                  equ 0006h
RXB0D2_RXB0D26_SIZE                      equ 0001h
RXB0D2_RXB0D26_LENGTH                    equ 0001h
RXB0D2_RXB0D26_MASK                      equ 0040h
RXB0D2_RXB0D27_POSN                      equ 0007h
RXB0D2_RXB0D27_POSITION                  equ 0007h
RXB0D2_RXB0D27_SIZE                      equ 0001h
RXB0D2_RXB0D27_LENGTH                    equ 0001h
RXB0D2_RXB0D27_MASK                      equ 0080h

// Register: RXB0D3
#define RXB0D3 RXB0D3
RXB0D3                                   equ 03F89h
// bitfield definitions
RXB0D3_RXB0D3_POSN                       equ 0000h
RXB0D3_RXB0D3_POSITION                   equ 0000h
RXB0D3_RXB0D3_SIZE                       equ 0008h
RXB0D3_RXB0D3_LENGTH                     equ 0008h
RXB0D3_RXB0D3_MASK                       equ 00FFh
RXB0D3_RXB0D30_POSN                      equ 0000h
RXB0D3_RXB0D30_POSITION                  equ 0000h
RXB0D3_RXB0D30_SIZE                      equ 0001h
RXB0D3_RXB0D30_LENGTH                    equ 0001h
RXB0D3_RXB0D30_MASK                      equ 0001h
RXB0D3_RXB0D31_POSN                      equ 0001h
RXB0D3_RXB0D31_POSITION                  equ 0001h
RXB0D3_RXB0D31_SIZE                      equ 0001h
RXB0D3_RXB0D31_LENGTH                    equ 0001h
RXB0D3_RXB0D31_MASK                      equ 0002h
RXB0D3_RXB0D32_POSN                      equ 0002h
RXB0D3_RXB0D32_POSITION                  equ 0002h
RXB0D3_RXB0D32_SIZE                      equ 0001h
RXB0D3_RXB0D32_LENGTH                    equ 0001h
RXB0D3_RXB0D32_MASK                      equ 0004h
RXB0D3_RXB0D33_POSN                      equ 0003h
RXB0D3_RXB0D33_POSITION                  equ 0003h
RXB0D3_RXB0D33_SIZE                      equ 0001h
RXB0D3_RXB0D33_LENGTH                    equ 0001h
RXB0D3_RXB0D33_MASK                      equ 0008h
RXB0D3_RXB0D34_POSN                      equ 0004h
RXB0D3_RXB0D34_POSITION                  equ 0004h
RXB0D3_RXB0D34_SIZE                      equ 0001h
RXB0D3_RXB0D34_LENGTH                    equ 0001h
RXB0D3_RXB0D34_MASK                      equ 0010h
RXB0D3_RXB0D35_POSN                      equ 0005h
RXB0D3_RXB0D35_POSITION                  equ 0005h
RXB0D3_RXB0D35_SIZE                      equ 0001h
RXB0D3_RXB0D35_LENGTH                    equ 0001h
RXB0D3_RXB0D35_MASK                      equ 0020h
RXB0D3_RXB0D36_POSN                      equ 0006h
RXB0D3_RXB0D36_POSITION                  equ 0006h
RXB0D3_RXB0D36_SIZE                      equ 0001h
RXB0D3_RXB0D36_LENGTH                    equ 0001h
RXB0D3_RXB0D36_MASK                      equ 0040h
RXB0D3_RXB0D37_POSN                      equ 0007h
RXB0D3_RXB0D37_POSITION                  equ 0007h
RXB0D3_RXB0D37_SIZE                      equ 0001h
RXB0D3_RXB0D37_LENGTH                    equ 0001h
RXB0D3_RXB0D37_MASK                      equ 0080h

