GopalSaraf/Practicals/PSDL/include/proc/pic18f26k83.inc
#define INT1IE                           BANKMASK(PIE4), 7, b
#define INT1IF                           BANKMASK(PIR4), 7, b
#define INT1IP                           BANKMASK(IPR4), 7, b
#define INT2EDG                          BANKMASK(INTCON0), 2, a
#define INT2IE                           BANKMASK(PIE8), 6, b
#define INT2IF                           BANKMASK(PIR8), 6, b
#define INT2IP                           BANKMASK(IPR8), 6, b
#define INTH                             BANKMASK(HLVDCON0), 1, b
#define INTL                             BANKMASK(HLVDCON0), 0, b
#define IOCAF0                           BANKMASK(IOCAF), 0, b
#define IOCAF1                           BANKMASK(IOCAF), 1, b
#define IOCAF2                           BANKMASK(IOCAF), 2, b
#define IOCAF3                           BANKMASK(IOCAF), 3, b
#define IOCAF4                           BANKMASK(IOCAF), 4, b
#define IOCAF5                           BANKMASK(IOCAF), 5, b
#define IOCAF6                           BANKMASK(IOCAF), 6, b
#define IOCAF7                           BANKMASK(IOCAF), 7, b
#define IOCAN0                           BANKMASK(IOCAN), 0, b
#define IOCAN1                           BANKMASK(IOCAN), 1, b
#define IOCAN2                           BANKMASK(IOCAN), 2, b
#define IOCAN3                           BANKMASK(IOCAN), 3, b
#define IOCAN4                           BANKMASK(IOCAN), 4, b
#define IOCAN5                           BANKMASK(IOCAN), 5, b
#define IOCAN6                           BANKMASK(IOCAN), 6, b
#define IOCAN7                           BANKMASK(IOCAN), 7, b
#define IOCAP0                           BANKMASK(IOCAP), 0, b
#define IOCAP1                           BANKMASK(IOCAP), 1, b
#define IOCAP2                           BANKMASK(IOCAP), 2, b
#define IOCAP3                           BANKMASK(IOCAP), 3, b
#define IOCAP4                           BANKMASK(IOCAP), 4, b
#define IOCAP5                           BANKMASK(IOCAP), 5, b
#define IOCAP6                           BANKMASK(IOCAP), 6, b
#define IOCAP7                           BANKMASK(IOCAP), 7, b
#define IOCBF0                           BANKMASK(IOCBF), 0, b
#define IOCBF1                           BANKMASK(IOCBF), 1, b
#define IOCBF2                           BANKMASK(IOCBF), 2, b
#define IOCBF3                           BANKMASK(IOCBF), 3, b
#define IOCBF4                           BANKMASK(IOCBF), 4, b
#define IOCBF5                           BANKMASK(IOCBF), 5, b
#define IOCBF6                           BANKMASK(IOCBF), 6, b
#define IOCBF7                           BANKMASK(IOCBF), 7, b
#define IOCBN0                           BANKMASK(IOCBN), 0, b
#define IOCBN1                           BANKMASK(IOCBN), 1, b
#define IOCBN2                           BANKMASK(IOCBN), 2, b
#define IOCBN3                           BANKMASK(IOCBN), 3, b
#define IOCBN4                           BANKMASK(IOCBN), 4, b
#define IOCBN5                           BANKMASK(IOCBN), 5, b
#define IOCBN6                           BANKMASK(IOCBN), 6, b
#define IOCBN7                           BANKMASK(IOCBN), 7, b
#define IOCBP0                           BANKMASK(IOCBP), 0, b
#define IOCBP1                           BANKMASK(IOCBP), 1, b
#define IOCBP2                           BANKMASK(IOCBP), 2, b
#define IOCBP3                           BANKMASK(IOCBP), 3, b
#define IOCBP4                           BANKMASK(IOCBP), 4, b
#define IOCBP5                           BANKMASK(IOCBP), 5, b
#define IOCBP6                           BANKMASK(IOCBP), 6, b
#define IOCBP7                           BANKMASK(IOCBP), 7, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF2                           BANKMASK(IOCCF), 2, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCF7                           BANKMASK(IOCCF), 7, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN2                           BANKMASK(IOCCN), 2, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
#define IOCCN4                           BANKMASK(IOCCN), 4, b
#define IOCCN5                           BANKMASK(IOCCN), 5, b
#define IOCCN6                           BANKMASK(IOCCN), 6, b
#define IOCCN7                           BANKMASK(IOCCN), 7, b
#define IOCCP0                           BANKMASK(IOCCP), 0, b
#define IOCCP1                           BANKMASK(IOCCP), 1, b
#define IOCCP2                           BANKMASK(IOCCP), 2, b
#define IOCCP3                           BANKMASK(IOCCP), 3, b
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCCP7                           BANKMASK(IOCCP), 7, b
#define IOCEF3                           BANKMASK(IOCEF), 3, b
#define IOCEN3                           BANKMASK(IOCEN), 3, b
#define IOCEP3                           BANKMASK(IOCEP), 3, b
#define IOCIE                            BANKMASK(PIE0), 7, b
#define IOCIF                            BANKMASK(PIR0), 7, b
#define IOCIP                            BANKMASK(IPR0), 7, b
#define IOCMD                            BANKMASK(PMD0), 0, b
#define IRXIE                            BANKMASK(PIE5), 7, b
#define IRXIF                            BANKMASK(PIR5), 7, b
#define IRXIP                            BANKMASK(IPR5), 7, b
#define ISRPR0                           BANKMASK(ISRPR), 0, b
#define ISRPR1                           BANKMASK(ISRPR), 1, b
#define ISRPR2                           BANKMASK(ISRPR), 2, b
#define IVTLOCKED                        BANKMASK(IVTLOCK), 0, a
#define JTOFF                            BANKMASK(RXB0CON), 1, a
#define JTOFF_FILHIT1                    BANKMASK(RXB0CON), 1, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC1D1S0                          BANKMASK(CLC1SEL0), 0, b
#define LC1D1S1                          BANKMASK(CLC1SEL0), 1, b
#define LC1D1S2                          BANKMASK(CLC1SEL0), 2, b
#define LC1D1S3                          BANKMASK(CLC1SEL0), 3, b
#define LC1D1S4                          BANKMASK(CLC1SEL0), 4, b
#define LC1D1S5                          BANKMASK(CLC1SEL0), 5, b
#define LC1D1S6                          BANKMASK(CLC1SEL0), 6, b
#define LC1D1S7                          BANKMASK(CLC1SEL0), 7, b
#define LC1D2S0                          BANKMASK(CLC1SEL1), 0, b
#define LC1D2S1                          BANKMASK(CLC1SEL1), 1, b
#define LC1D2S2                          BANKMASK(CLC1SEL1), 2, b
#define LC1D2S3                          BANKMASK(CLC1SEL1), 3, b
#define LC1D2S4                          BANKMASK(CLC1SEL1), 4, b
#define LC1D2S5                          BANKMASK(CLC1SEL1), 5, b
#define LC1D2S6                          BANKMASK(CLC1SEL1), 6, b
#define LC1D2S7                          BANKMASK(CLC1SEL1), 7, b
#define LC1D3S0                          BANKMASK(CLC1SEL2), 0, b
#define LC1D3S1                          BANKMASK(CLC1SEL2), 1, b
#define LC1D3S2                          BANKMASK(CLC1SEL2), 2, b
#define LC1D3S3                          BANKMASK(CLC1SEL2), 3, b
#define LC1D3S4                          BANKMASK(CLC1SEL2), 4, b
#define LC1D3S5                          BANKMASK(CLC1SEL2), 5, b
#define LC1D3S6                          BANKMASK(CLC1SEL2), 6, b
#define LC1D3S7                          BANKMASK(CLC1SEL2), 7, b
#define LC1D4S0                          BANKMASK(CLC1SEL3), 0, b
#define LC1D4S1                          BANKMASK(CLC1SEL3), 1, b
#define LC1D4S2                          BANKMASK(CLC1SEL3), 2, b
#define LC1D4S3                          BANKMASK(CLC1SEL3), 3, b
#define LC1D4S4                          BANKMASK(CLC1SEL3), 4, b
#define LC1D4S5                          BANKMASK(CLC1SEL3), 5, b
#define LC1D4S6                          BANKMASK(CLC1SEL3), 6, b
#define LC1D4S7                          BANKMASK(CLC1SEL3), 7, b
#define LC1EN                            BANKMASK(CLC1CON), 7, b
#define LC1G1D1N                         BANKMASK(CLC1GLS0), 0, b
#define LC1G1D1T                         BANKMASK(CLC1GLS0), 1, b
#define LC1G1D2N                         BANKMASK(CLC1GLS0), 2, b
#define LC1G1D2T                         BANKMASK(CLC1GLS0), 3, b
#define LC1G1D3N                         BANKMASK(CLC1GLS0), 4, b
#define LC1G1D3T                         BANKMASK(CLC1GLS0), 5, b
#define LC1G1D4N                         BANKMASK(CLC1GLS0), 6, b
#define LC1G1D4T                         BANKMASK(CLC1GLS0), 7, b
#define LC1G1POL                         BANKMASK(CLC1POL), 0, b
#define LC1G2D1N                         BANKMASK(CLC1GLS1), 0, b
#define LC1G2D1T                         BANKMASK(CLC1GLS1), 1, b
#define LC1G2D2N                         BANKMASK(CLC1GLS1), 2, b
#define LC1G2D2T                         BANKMASK(CLC1GLS1), 3, b
#define LC1G2D3N                         BANKMASK(CLC1GLS1), 4, b
#define LC1G2D3T                         BANKMASK(CLC1GLS1), 5, b
#define LC1G2D4N                         BANKMASK(CLC1GLS1), 6, b
#define LC1G2D4T                         BANKMASK(CLC1GLS1), 7, b
#define LC1G2POL                         BANKMASK(CLC1POL), 1, b
#define LC1G3D1N                         BANKMASK(CLC1GLS2), 0, b
#define LC1G3D1T                         BANKMASK(CLC1GLS2), 1, b
#define LC1G3D2N                         BANKMASK(CLC1GLS2), 2, b
#define LC1G3D2T                         BANKMASK(CLC1GLS2), 3, b
#define LC1G3D3N                         BANKMASK(CLC1GLS2), 4, b
#define LC1G3D3T                         BANKMASK(CLC1GLS2), 5, b
#define LC1G3D4N                         BANKMASK(CLC1GLS2), 6, b
#define LC1G3D4T                         BANKMASK(CLC1GLS2), 7, b
#define LC1G3POL                         BANKMASK(CLC1POL), 2, b
#define LC1G4D1N                         BANKMASK(CLC1GLS3), 0, b
#define LC1G4D1T                         BANKMASK(CLC1GLS3), 1, b
#define LC1G4D2N                         BANKMASK(CLC1GLS3), 2, b
#define LC1G4D2T                         BANKMASK(CLC1GLS3), 3, b
#define LC1G4D3N                         BANKMASK(CLC1GLS3), 4, b
#define LC1G4D3T                         BANKMASK(CLC1GLS3), 5, b
#define LC1G4D4N                         BANKMASK(CLC1GLS3), 6, b
#define LC1G4D4T                         BANKMASK(CLC1GLS3), 7, b
#define LC1G4POL                         BANKMASK(CLC1POL), 3, b
#define LC1INTN                          BANKMASK(CLC1CON), 3, b
#define LC1INTP                          BANKMASK(CLC1CON), 4, b
#define LC1MODE0                         BANKMASK(CLC1CON), 0, b
#define LC1MODE1                         BANKMASK(CLC1CON), 1, b
#define LC1MODE2                         BANKMASK(CLC1CON), 2, b
#define LC1OE                            BANKMASK(CLC1CON), 6, b
#define LC1OUT                           BANKMASK(CLC1CON), 5, b
#define LC1POL                           BANKMASK(CLC1POL), 7, b
#define LC2                              BANKMASK(LATC), 2, a
#define LC2D1S0                          BANKMASK(CLC2SEL0), 0, b
#define LC2D1S1                          BANKMASK(CLC2SEL0), 1, b
#define LC2D1S2                          BANKMASK(CLC2SEL0), 2, b
#define LC2D1S3                          BANKMASK(CLC2SEL0), 3, b
#define LC2D1S4                          BANKMASK(CLC2SEL0), 4, b
#define LC2D1S5                          BANKMASK(CLC2SEL0), 5, b
#define LC2D1S6                          BANKMASK(CLC2SEL0), 6, b
#define LC2D1S7                          BANKMASK(CLC2SEL0), 7, b
#define LC2D2S0                          BANKMASK(CLC2SEL1), 0, b
#define LC2D2S1                          BANKMASK(CLC2SEL1), 1, b
#define LC2D2S2                          BANKMASK(CLC2SEL1), 2, b
#define LC2D2S3                          BANKMASK(CLC2SEL1), 3, b
#define LC2D2S4                          BANKMASK(CLC2SEL1), 4, b
#define LC2D2S5                          BANKMASK(CLC2SEL1), 5, b
#define LC2D2S6                          BANKMASK(CLC2SEL1), 6, b
#define LC2D2S7                          BANKMASK(CLC2SEL1), 7, b
#define LC2D3S0                          BANKMASK(CLC2SEL2), 0, b
#define LC2D3S1                          BANKMASK(CLC2SEL2), 1, b
#define LC2D3S2                          BANKMASK(CLC2SEL2), 2, b
#define LC2D3S3                          BANKMASK(CLC2SEL2), 3, b
#define LC2D3S4                          BANKMASK(CLC2SEL2), 4, b
#define LC2D3S5                          BANKMASK(CLC2SEL2), 5, b
#define LC2D3S6                          BANKMASK(CLC2SEL2), 6, b
#define LC2D3S7                          BANKMASK(CLC2SEL2), 7, b
#define LC2D4S0                          BANKMASK(CLC2SEL3), 0, b
#define LC2D4S1                          BANKMASK(CLC2SEL3), 1, b
#define LC2D4S2                          BANKMASK(CLC2SEL3), 2, b
#define LC2D4S3                          BANKMASK(CLC2SEL3), 3, b
#define LC2D4S4                          BANKMASK(CLC2SEL3), 4, b
#define LC2D4S5                          BANKMASK(CLC2SEL3), 5, b
#define LC2D4S6                          BANKMASK(CLC2SEL3), 6, b
#define LC2D4S7                          BANKMASK(CLC2SEL3), 7, b
#define LC2EN                            BANKMASK(CLC2CON), 7, b
#define LC2G1D1N                         BANKMASK(CLC2GLS0), 0, b
#define LC2G1D1T                         BANKMASK(CLC2GLS0), 1, b
#define LC2G1D2N                         BANKMASK(CLC2GLS0), 2, b
#define LC2G1D2T                         BANKMASK(CLC2GLS0), 3, b
#define LC2G1D3N                         BANKMASK(CLC2GLS0), 4, b
#define LC2G1D3T                         BANKMASK(CLC2GLS0), 5, b
#define LC2G1D4N                         BANKMASK(CLC2GLS0), 6, b
#define LC2G1D4T                         BANKMASK(CLC2GLS0), 7, b
#define LC2G1POL                         BANKMASK(CLC2POL), 0, b
#define LC2G2D1N                         BANKMASK(CLC2GLS1), 0, b
#define LC2G2D1T                         BANKMASK(CLC2GLS1), 1, b
#define LC2G2D2N                         BANKMASK(CLC2GLS1), 2, b
#define LC2G2D2T                         BANKMASK(CLC2GLS1), 3, b
#define LC2G2D3N                         BANKMASK(CLC2GLS1), 4, b
#define LC2G2D3T                         BANKMASK(CLC2GLS1), 5, b
#define LC2G2D4N                         BANKMASK(CLC2GLS1), 6, b
#define LC2G2D4T                         BANKMASK(CLC2GLS1), 7, b
#define LC2G2POL                         BANKMASK(CLC2POL), 1, b
#define LC2G3D1N                         BANKMASK(CLC2GLS2), 0, b
#define LC2G3D1T                         BANKMASK(CLC2GLS2), 1, b
#define LC2G3D2N                         BANKMASK(CLC2GLS2), 2, b
#define LC2G3D2T                         BANKMASK(CLC2GLS2), 3, b
#define LC2G3D3N                         BANKMASK(CLC2GLS2), 4, b
#define LC2G3D3T                         BANKMASK(CLC2GLS2), 5, b
#define LC2G3D4N                         BANKMASK(CLC2GLS2), 6, b
#define LC2G3D4T                         BANKMASK(CLC2GLS2), 7, b
#define LC2G3POL                         BANKMASK(CLC2POL), 2, b
#define LC2G4D1N                         BANKMASK(CLC2GLS3), 0, b
#define LC2G4D1T                         BANKMASK(CLC2GLS3), 1, b
#define LC2G4D2N                         BANKMASK(CLC2GLS3), 2, b
#define LC2G4D2T                         BANKMASK(CLC2GLS3), 3, b
#define LC2G4D3N                         BANKMASK(CLC2GLS3), 4, b
#define LC2G4D3T                         BANKMASK(CLC2GLS3), 5, b
#define LC2G4D4N                         BANKMASK(CLC2GLS3), 6, b
#define LC2G4D4T                         BANKMASK(CLC2GLS3), 7, b
#define LC2G4POL                         BANKMASK(CLC2POL), 3, b
#define LC2INTN                          BANKMASK(CLC2CON), 3, b
#define LC2INTP                          BANKMASK(CLC2CON), 4, b
#define LC2MODE0                         BANKMASK(CLC2CON), 0, b
#define LC2MODE1                         BANKMASK(CLC2CON), 1, b
#define LC2MODE2                         BANKMASK(CLC2CON), 2, b
#define LC2OE                            BANKMASK(CLC2CON), 6, b
#define LC2OUT                           BANKMASK(CLC2CON), 5, b
#define LC2POL                           BANKMASK(CLC2POL), 7, b
#define LC3                              BANKMASK(LATC), 3, a
#define LC3D1S0                          BANKMASK(CLC3SEL0), 0, b
#define LC3D1S1                          BANKMASK(CLC3SEL0), 1, b
#define LC3D1S2                          BANKMASK(CLC3SEL0), 2, b
#define LC3D1S3                          BANKMASK(CLC3SEL0), 3, b
#define LC3D1S4                          BANKMASK(CLC3SEL0), 4, b
#define LC3D1S5                          BANKMASK(CLC3SEL0), 5, b
#define LC3D1S6                          BANKMASK(CLC3SEL0), 6, b
#define LC3D1S7                          BANKMASK(CLC3SEL0), 7, b
#define LC3D2S0                          BANKMASK(CLC3SEL1), 0, b
#define LC3D2S1                          BANKMASK(CLC3SEL1), 1, b
#define LC3D2S2                          BANKMASK(CLC3SEL1), 2, b
#define LC3D2S3                          BANKMASK(CLC3SEL1), 3, b
#define LC3D2S4                          BANKMASK(CLC3SEL1), 4, b
#define LC3D2S5                          BANKMASK(CLC3SEL1), 5, b
#define LC3D2S6                          BANKMASK(CLC3SEL1), 6, b
#define LC3D2S7                          BANKMASK(CLC3SEL1), 7, b
#define LC3D3S0                          BANKMASK(CLC3SEL2), 0, b
#define LC3D3S1                          BANKMASK(CLC3SEL2), 1, b
#define LC3D3S2                          BANKMASK(CLC3SEL2), 2, b
#define LC3D3S3                          BANKMASK(CLC3SEL2), 3, b
#define LC3D3S4                          BANKMASK(CLC3SEL2), 4, b
#define LC3D3S5                          BANKMASK(CLC3SEL2), 5, b
#define LC3D3S6                          BANKMASK(CLC3SEL2), 6, b
#define LC3D3S7                          BANKMASK(CLC3SEL2), 7, b
#define LC3D4S0                          BANKMASK(CLC3SEL3), 0, b
#define LC3D4S1                          BANKMASK(CLC3SEL3), 1, b
#define LC3D4S2                          BANKMASK(CLC3SEL3), 2, b
#define LC3D4S3                          BANKMASK(CLC3SEL3), 3, b
#define LC3D4S4                          BANKMASK(CLC3SEL3), 4, b
#define LC3D4S5                          BANKMASK(CLC3SEL3), 5, b
#define LC3D4S6                          BANKMASK(CLC3SEL3), 6, b
#define LC3D4S7                          BANKMASK(CLC3SEL3), 7, b
#define LC3EN                            BANKMASK(CLC3CON), 7, b
#define LC3G1D1N                         BANKMASK(CLC3GLS0), 0, b
#define LC3G1D1T                         BANKMASK(CLC3GLS0), 1, b
#define LC3G1D2N                         BANKMASK(CLC3GLS0), 2, b
#define LC3G1D2T                         BANKMASK(CLC3GLS0), 3, b
#define LC3G1D3N                         BANKMASK(CLC3GLS0), 4, b
#define LC3G1D3T                         BANKMASK(CLC3GLS0), 5, b
#define LC3G1D4N                         BANKMASK(CLC3GLS0), 6, b
#define LC3G1D4T                         BANKMASK(CLC3GLS0), 7, b
#define LC3G1POL                         BANKMASK(CLC3POL), 0, b
#define LC3G2D1N                         BANKMASK(CLC3GLS1), 0, b
#define LC3G2D1T                         BANKMASK(CLC3GLS1), 1, b
#define LC3G2D2N                         BANKMASK(CLC3GLS1), 2, b
#define LC3G2D2T                         BANKMASK(CLC3GLS1), 3, b
#define LC3G2D3N                         BANKMASK(CLC3GLS1), 4, b
#define LC3G2D3T                         BANKMASK(CLC3GLS1), 5, b
#define LC3G2D4N                         BANKMASK(CLC3GLS1), 6, b
#define LC3G2D4T                         BANKMASK(CLC3GLS1), 7, b
#define LC3G2POL                         BANKMASK(CLC3POL), 1, b
#define LC3G3D1N                         BANKMASK(CLC3GLS2), 0, b
#define LC3G3D1T                         BANKMASK(CLC3GLS2), 1, b
