GopalSaraf/Practicals/PSDL/include/proc/pic18f26k83.inc
#define TCZIF                            BANKMASK(SPI1INTF), 6, b
#define TEC0                             BANKMASK(TXERRCNT), 0, b
#define TEC1                             BANKMASK(TXERRCNT), 1, b
#define TEC2                             BANKMASK(TXERRCNT), 2, b
#define TEC3                             BANKMASK(TXERRCNT), 3, b
#define TEC4                             BANKMASK(TXERRCNT), 4, b
#define TEC5                             BANKMASK(TXERRCNT), 5, b
#define TEC6                             BANKMASK(TXERRCNT), 6, b
#define TEC7                             BANKMASK(TXERRCNT), 7, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0H0                           BANKMASK(TMR0H), 0, a
#define TMR0H1                           BANKMASK(TMR0H), 1, a
#define TMR0H2                           BANKMASK(TMR0H), 2, a
#define TMR0H3                           BANKMASK(TMR0H), 3, a
#define TMR0H4                           BANKMASK(TMR0H), 4, a
#define TMR0H5                           BANKMASK(TMR0H), 5, a
#define TMR0H6                           BANKMASK(TMR0H), 6, a
#define TMR0H7                           BANKMASK(TMR0H), 7, a
#define TMR0IE                           BANKMASK(PIE3), 7, b
#define TMR0IF                           BANKMASK(PIR3), 7, b
#define TMR0IP                           BANKMASK(IPR3), 7, b
#define TMR0L0                           BANKMASK(TMR0L), 0, a
#define TMR0L1                           BANKMASK(TMR0L), 1, a
#define TMR0L2                           BANKMASK(TMR0L), 2, a
#define TMR0L3                           BANKMASK(TMR0L), 3, a
#define TMR0L4                           BANKMASK(TMR0L), 4, a
#define TMR0L5                           BANKMASK(TMR0L), 5, a
#define TMR0L6                           BANKMASK(TMR0L), 6, a
#define TMR0L7                           BANKMASK(TMR0L), 7, a
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR1GIE                          BANKMASK(PIE4), 1, b
#define TMR1GIF                          BANKMASK(PIR4), 1, b
#define TMR1GIP                          BANKMASK(IPR4), 1, b
#define TMR1H0                           BANKMASK(TMR1H), 0, a
#define TMR1H1                           BANKMASK(TMR1H), 1, a
#define TMR1H2                           BANKMASK(TMR1H), 2, a
#define TMR1H3                           BANKMASK(TMR1H), 3, a
#define TMR1H4                           BANKMASK(TMR1H), 4, a
#define TMR1H5                           BANKMASK(TMR1H), 5, a
#define TMR1H6                           BANKMASK(TMR1H), 6, a
#define TMR1H7                           BANKMASK(TMR1H), 7, a
#define TMR1IE                           BANKMASK(PIE4), 0, b
#define TMR1IF                           BANKMASK(PIR4), 0, b
#define TMR1IP                           BANKMASK(IPR4), 0, b
#define TMR1L0                           BANKMASK(TMR1L), 0, a
#define TMR1L1                           BANKMASK(TMR1L), 1, a
#define TMR1L2                           BANKMASK(TMR1L), 2, a
#define TMR1L3                           BANKMASK(TMR1L), 3, a
#define TMR1L4                           BANKMASK(TMR1L), 4, a
#define TMR1L5                           BANKMASK(TMR1L), 5, a
#define TMR1L6                           BANKMASK(TMR1L), 6, a
#define TMR1L7                           BANKMASK(TMR1L), 7, a
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE4), 2, b
#define TMR2IF                           BANKMASK(PIR4), 2, b
#define TMR2IP                           BANKMASK(IPR4), 2, b
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, a
#define TMR3GIE                          BANKMASK(PIE8), 1, b
#define TMR3GIF                          BANKMASK(PIR8), 1, b
#define TMR3GIP                          BANKMASK(IPR8), 1, b
#define TMR3H0                           BANKMASK(TMR3H), 0, a
#define TMR3H1                           BANKMASK(TMR3H), 1, a
#define TMR3H2                           BANKMASK(TMR3H), 2, a
#define TMR3H3                           BANKMASK(TMR3H), 3, a
#define TMR3H4                           BANKMASK(TMR3H), 4, a
#define TMR3H5                           BANKMASK(TMR3H), 5, a
#define TMR3H6                           BANKMASK(TMR3H), 6, a
#define TMR3H7                           BANKMASK(TMR3H), 7, a
#define TMR3IE                           BANKMASK(PIE8), 0, b
#define TMR3IF                           BANKMASK(PIR8), 0, b
#define TMR3IP                           BANKMASK(IPR8), 0, b
#define TMR3L0                           BANKMASK(TMR3L), 0, a
#define TMR3L1                           BANKMASK(TMR3L), 1, a
#define TMR3L2                           BANKMASK(TMR3L), 2, a
#define TMR3L3                           BANKMASK(TMR3L), 3, a
#define TMR3L4                           BANKMASK(TMR3L), 4, a
#define TMR3L5                           BANKMASK(TMR3L), 5, a
#define TMR3L6                           BANKMASK(TMR3L), 6, a
#define TMR3L7                           BANKMASK(TMR3L), 7, a
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TMR4IE                           BANKMASK(PIE8), 2, b
#define TMR4IF                           BANKMASK(PIR8), 2, b
#define TMR4IP                           BANKMASK(IPR8), 2, b
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, a
#define TMR5GIE                          BANKMASK(PIE9), 0, b
#define TMR5GIF                          BANKMASK(PIR9), 0, b
#define TMR5GIP                          BANKMASK(IPR9), 0, b
#define TMR5H0                           BANKMASK(TMR5H), 0, a
#define TMR5H1                           BANKMASK(TMR5H), 1, a
#define TMR5H2                           BANKMASK(TMR5H), 2, a
#define TMR5H3                           BANKMASK(TMR5H), 3, a
#define TMR5H4                           BANKMASK(TMR5H), 4, a
#define TMR5H5                           BANKMASK(TMR5H), 5, a
#define TMR5H6                           BANKMASK(TMR5H), 6, a
#define TMR5H7                           BANKMASK(TMR5H), 7, a
#define TMR5IE                           BANKMASK(PIE8), 7, b
#define TMR5IF                           BANKMASK(PIR8), 7, b
#define TMR5IP                           BANKMASK(IPR8), 7, b
#define TMR5L0                           BANKMASK(TMR5L), 0, a
#define TMR5L1                           BANKMASK(TMR5L), 1, a
#define TMR5L2                           BANKMASK(TMR5L), 2, a
#define TMR5L3                           BANKMASK(TMR5L), 3, a
#define TMR5L4                           BANKMASK(TMR5L), 4, a
#define TMR5L5                           BANKMASK(TMR5L), 5, a
#define TMR5L6                           BANKMASK(TMR5L), 6, a
#define TMR5L7                           BANKMASK(TMR5L), 7, a
#define TMR5MD                           BANKMASK(PMD1), 5, b
#define TMR5ON                           BANKMASK(T5CON), 0, a
#define TMR6IE                           BANKMASK(PIE9), 1, b
#define TMR6IF                           BANKMASK(PIR9), 1, b
#define TMR6IP                           BANKMASK(IPR9), 1, b
#define TMR6MD                           BANKMASK(PMD1), 6, b
#define TMR6ON                           BANKMASK(T6CON), 7, a
#define TRIGEN                           BANKMASK(SCANCON0), 6, b
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TWIDTH0                          BANKMASK(SPI1TWIDTH), 0, b
#define TWIDTH1                          BANKMASK(SPI1TWIDTH), 1, b
#define TWIDTH2                          BANKMASK(SPI1TWIDTH), 2, b
#define TX1IE                            BANKMASK(PIE1), 4, b
#define TX1IF                            BANKMASK(PIR1), 4, b
#define TX1IP                            BANKMASK(IPR1), 4, b
#define TX1SRC                           BANKMASK(CIOCON), 7, b
#define TXB0                             BANKMASK(SPI1TXB), 0, b
#define TXB0D00                          BANKMASK(TXB0D0), 0, b
#define TXB0D01                          BANKMASK(TXB0D0), 1, b
#define TXB0D02                          BANKMASK(TXB0D0), 2, b
#define TXB0D03                          BANKMASK(TXB0D0), 3, b
#define TXB0D04                          BANKMASK(TXB0D0), 4, b
#define TXB0D05                          BANKMASK(TXB0D0), 5, b
#define TXB0D06                          BANKMASK(TXB0D0), 6, b
#define TXB0D07                          BANKMASK(TXB0D0), 7, b
#define TXB0D10                          BANKMASK(TXB0D1), 0, b
#define TXB0D11                          BANKMASK(TXB0D1), 1, b
#define TXB0D12                          BANKMASK(TXB0D1), 2, b
#define TXB0D13                          BANKMASK(TXB0D1), 3, b
#define TXB0D14                          BANKMASK(TXB0D1), 4, b
#define TXB0D15                          BANKMASK(TXB0D1), 5, b
#define TXB0D16                          BANKMASK(TXB0D1), 6, b
#define TXB0D17                          BANKMASK(TXB0D1), 7, b
#define TXB0D20                          BANKMASK(TXB0D2), 0, b
#define TXB0D21                          BANKMASK(TXB0D2), 1, b
#define TXB0D22                          BANKMASK(TXB0D2), 2, b
#define TXB0D23                          BANKMASK(TXB0D2), 3, b
#define TXB0D24                          BANKMASK(TXB0D2), 4, b
#define TXB0D25                          BANKMASK(TXB0D2), 5, b
#define TXB0D26                          BANKMASK(TXB0D2), 6, b
#define TXB0D27                          BANKMASK(TXB0D2), 7, b
#define TXB0D30                          BANKMASK(TXB0D3), 0, b
#define TXB0D31                          BANKMASK(TXB0D3), 1, b
#define TXB0D32                          BANKMASK(TXB0D3), 2, b
#define TXB0D33                          BANKMASK(TXB0D3), 3, b
#define TXB0D34                          BANKMASK(TXB0D3), 4, b
#define TXB0D35                          BANKMASK(TXB0D3), 5, b
#define TXB0D36                          BANKMASK(TXB0D3), 6, b
#define TXB0D37                          BANKMASK(TXB0D3), 7, b
#define TXB0D40                          BANKMASK(TXB0D4), 0, b
#define TXB0D41                          BANKMASK(TXB0D4), 1, b
#define TXB0D42                          BANKMASK(TXB0D4), 2, b
#define TXB0D43                          BANKMASK(TXB0D4), 3, b
#define TXB0D44                          BANKMASK(TXB0D4), 4, b
#define TXB0D45                          BANKMASK(TXB0D4), 5, b
#define TXB0D46                          BANKMASK(TXB0D4), 6, b
#define TXB0D47                          BANKMASK(TXB0D4), 7, b
#define TXB0D50                          BANKMASK(TXB0D5), 0, b
#define TXB0D51                          BANKMASK(TXB0D5), 1, b
#define TXB0D52                          BANKMASK(TXB0D5), 2, b
#define TXB0D53                          BANKMASK(TXB0D5), 3, b
#define TXB0D54                          BANKMASK(TXB0D5), 4, b
#define TXB0D55                          BANKMASK(TXB0D5), 5, b
#define TXB0D56                          BANKMASK(TXB0D5), 6, b
#define TXB0D57                          BANKMASK(TXB0D5), 7, b
#define TXB0D60                          BANKMASK(TXB0D6), 0, b
#define TXB0D61                          BANKMASK(TXB0D6), 1, b
#define TXB0D62                          BANKMASK(TXB0D6), 2, b
#define TXB0D63                          BANKMASK(TXB0D6), 3, b
#define TXB0D64                          BANKMASK(TXB0D6), 4, b
#define TXB0D65                          BANKMASK(TXB0D6), 5, b
#define TXB0D66                          BANKMASK(TXB0D6), 6, b
#define TXB0D67                          BANKMASK(TXB0D6), 7, b
#define TXB0D70                          BANKMASK(TXB0D7), 0, b
#define TXB0D71                          BANKMASK(TXB0D7), 1, b
#define TXB0D72                          BANKMASK(TXB0D7), 2, b
#define TXB0D73                          BANKMASK(TXB0D7), 3, b
#define TXB0D74                          BANKMASK(TXB0D7), 4, b
#define TXB0D75                          BANKMASK(TXB0D7), 5, b
#define TXB0D76                          BANKMASK(TXB0D7), 6, b
#define TXB0D77                          BANKMASK(TXB0D7), 7, b
#define TXB0IF                           BANKMASK(PIR5), 2, b
#define TXB0IP                           BANKMASK(IPR5), 2, b
#define TXB1                             BANKMASK(SPI1TXB), 1, b
#define TXB1D00                          BANKMASK(TXB1D0), 0, b
#define TXB1D01                          BANKMASK(TXB1D0), 1, b
#define TXB1D02                          BANKMASK(TXB1D0), 2, b
#define TXB1D03                          BANKMASK(TXB1D0), 3, b
#define TXB1D04                          BANKMASK(TXB1D0), 4, b
#define TXB1D05                          BANKMASK(TXB1D0), 5, b
#define TXB1D06                          BANKMASK(TXB1D0), 6, b
#define TXB1D07                          BANKMASK(TXB1D0), 7, b
#define TXB1D10                          BANKMASK(TXB1D1), 0, b
#define TXB1D11                          BANKMASK(TXB1D1), 1, b
#define TXB1D12                          BANKMASK(TXB1D1), 2, b
#define TXB1D13                          BANKMASK(TXB1D1), 3, b
#define TXB1D14                          BANKMASK(TXB1D1), 4, b
#define TXB1D15                          BANKMASK(TXB1D1), 5, b
#define TXB1D16                          BANKMASK(TXB1D1), 6, b
#define TXB1D17                          BANKMASK(TXB1D1), 7, b
#define TXB1D20                          BANKMASK(TXB1D2), 0, b
#define TXB1D21                          BANKMASK(TXB1D2), 1, b
#define TXB1D22                          BANKMASK(TXB1D2), 2, b
#define TXB1D23                          BANKMASK(TXB1D2), 3, b
#define TXB1D24                          BANKMASK(TXB1D2), 4, b
#define TXB1D25                          BANKMASK(TXB1D2), 5, b
#define TXB1D26                          BANKMASK(TXB1D2), 6, b
#define TXB1D27                          BANKMASK(TXB1D2), 7, b
#define TXB1D30                          BANKMASK(TXB1D3), 0, b
#define TXB1D31                          BANKMASK(TXB1D3), 1, b
#define TXB1D32                          BANKMASK(TXB1D3), 2, b
#define TXB1D33                          BANKMASK(TXB1D3), 3, b
#define TXB1D34                          BANKMASK(TXB1D3), 4, b
#define TXB1D35                          BANKMASK(TXB1D3), 5, b
#define TXB1D36                          BANKMASK(TXB1D3), 6, b
#define TXB1D37                          BANKMASK(TXB1D3), 7, b
#define TXB1D40                          BANKMASK(TXB1D4), 0, b
#define TXB1D41                          BANKMASK(TXB1D4), 1, b
#define TXB1D42                          BANKMASK(TXB1D4), 2, b
#define TXB1D43                          BANKMASK(TXB1D4), 3, b
#define TXB1D44                          BANKMASK(TXB1D4), 4, b
#define TXB1D45                          BANKMASK(TXB1D4), 5, b
#define TXB1D46                          BANKMASK(TXB1D4), 6, b
#define TXB1D47                          BANKMASK(TXB1D4), 7, b
#define TXB1D50                          BANKMASK(TXB1D5), 0, b
#define TXB1D51                          BANKMASK(TXB1D5), 1, b
#define TXB1D52                          BANKMASK(TXB1D5), 2, b
#define TXB1D53                          BANKMASK(TXB1D5), 3, b
#define TXB1D54                          BANKMASK(TXB1D5), 4, b
#define TXB1D55                          BANKMASK(TXB1D5), 5, b
#define TXB1D56                          BANKMASK(TXB1D5), 6, b
#define TXB1D57                          BANKMASK(TXB1D5), 7, b
#define TXB1D60                          BANKMASK(TXB1D6), 0, b
#define TXB1D61                          BANKMASK(TXB1D6), 1, b
#define TXB1D62                          BANKMASK(TXB1D6), 2, b
#define TXB1D63                          BANKMASK(TXB1D6), 3, b
#define TXB1D64                          BANKMASK(TXB1D6), 4, b
#define TXB1D65                          BANKMASK(TXB1D6), 5, b
#define TXB1D66                          BANKMASK(TXB1D6), 6, b
#define TXB1D67                          BANKMASK(TXB1D6), 7, b
#define TXB1D70                          BANKMASK(TXB1D7), 0, b
#define TXB1D71                          BANKMASK(TXB1D7), 1, b
#define TXB1D72                          BANKMASK(TXB1D7), 2, b
#define TXB1D73                          BANKMASK(TXB1D7), 3, b
#define TXB1D74                          BANKMASK(TXB1D7), 4, b
#define TXB1D75                          BANKMASK(TXB1D7), 5, b
#define TXB1D76                          BANKMASK(TXB1D7), 6, b
#define TXB1D77                          BANKMASK(TXB1D7), 7, b
#define TXB1IF                           BANKMASK(PIR5), 3, b
#define TXB1IP                           BANKMASK(IPR5), 3, b
#define TXB2                             BANKMASK(SPI1TXB), 2, b
#define TXB2D00                          BANKMASK(TXB2D0), 0, b
#define TXB2D01                          BANKMASK(TXB2D0), 1, b
#define TXB2D02                          BANKMASK(TXB2D0), 2, b
#define TXB2D03                          BANKMASK(TXB2D0), 3, b
#define TXB2D04                          BANKMASK(TXB2D0), 4, b
#define TXB2D05                          BANKMASK(TXB2D0), 5, b
#define TXB2D06                          BANKMASK(TXB2D0), 6, b
#define TXB2D07                          BANKMASK(TXB2D0), 7, b
#define TXB2D10                          BANKMASK(TXB2D1), 0, b
#define TXB2D11                          BANKMASK(TXB2D1), 1, b
#define TXB2D12                          BANKMASK(TXB2D1), 2, b
#define TXB2D13                          BANKMASK(TXB2D1), 3, b
#define TXB2D14                          BANKMASK(TXB2D1), 4, b
#define TXB2D15                          BANKMASK(TXB2D1), 5, b
#define TXB2D16                          BANKMASK(TXB2D1), 6, b
#define TXB2D17                          BANKMASK(TXB2D1), 7, b
#define TXB2D20                          BANKMASK(TXB2D2), 0, b
#define TXB2D21                          BANKMASK(TXB2D2), 1, b
#define TXB2D22                          BANKMASK(TXB2D2), 2, b
#define TXB2D23                          BANKMASK(TXB2D2), 3, b
#define TXB2D24                          BANKMASK(TXB2D2), 4, b
#define TXB2D25                          BANKMASK(TXB2D2), 5, b
#define TXB2D26                          BANKMASK(TXB2D2), 6, b
#define TXB2D27                          BANKMASK(TXB2D2), 7, b
#define TXB2D30                          BANKMASK(TXB2D3), 0, b
#define TXB2D31                          BANKMASK(TXB2D3), 1, b
#define TXB2D32                          BANKMASK(TXB2D3), 2, b
#define TXB2D33                          BANKMASK(TXB2D3), 3, b
#define TXB2D34                          BANKMASK(TXB2D3), 4, b
#define TXB2D35                          BANKMASK(TXB2D3), 5, b
#define TXB2D36                          BANKMASK(TXB2D3), 6, b
#define TXB2D37                          BANKMASK(TXB2D3), 7, b
#define TXB2D40                          BANKMASK(TXB2D4), 0, b
#define TXB2D41                          BANKMASK(TXB2D4), 1, b
#define TXB2D42                          BANKMASK(TXB2D4), 2, b
#define TXB2D43                          BANKMASK(TXB2D4), 3, b
#define TXB2D44                          BANKMASK(TXB2D4), 4, b
#define TXB2D45                          BANKMASK(TXB2D4), 5, b
#define TXB2D46                          BANKMASK(TXB2D4), 6, b
#define TXB2D47                          BANKMASK(TXB2D4), 7, b
#define TXB2D50                          BANKMASK(TXB2D5), 0, b
#define TXB2D51                          BANKMASK(TXB2D5), 1, b
#define TXB2D52                          BANKMASK(TXB2D5), 2, b
#define TXB2D53                          BANKMASK(TXB2D5), 3, b
#define TXB2D54                          BANKMASK(TXB2D5), 4, b
#define TXB2D55                          BANKMASK(TXB2D5), 5, b
#define TXB2D56                          BANKMASK(TXB2D5), 6, b
#define TXB2D57                          BANKMASK(TXB2D5), 7, b
#define TXB2D60                          BANKMASK(TXB2D6), 0, b
#define TXB2D61                          BANKMASK(TXB2D6), 1, b
#define TXB2D62                          BANKMASK(TXB2D6), 2, b
#define TXB2D63                          BANKMASK(TXB2D6), 3, b
#define TXB2D64                          BANKMASK(TXB2D6), 4, b
#define TXB2D65                          BANKMASK(TXB2D6), 5, b
#define TXB2D66                          BANKMASK(TXB2D6), 6, b
#define TXB2D67                          BANKMASK(TXB2D6), 7, b
#define TXB2D70                          BANKMASK(TXB2D7), 0, b
#define TXB2D71                          BANKMASK(TXB2D7), 1, b
#define TXB2D72                          BANKMASK(TXB2D7), 2, b
#define TXB2D73                          BANKMASK(TXB2D7), 3, b
#define TXB2D74                          BANKMASK(TXB2D7), 4, b
#define TXB2D75                          BANKMASK(TXB2D7), 5, b
#define TXB2D76                          BANKMASK(TXB2D7), 6, b
#define TXB2D77                          BANKMASK(TXB2D7), 7, b
#define TXB2IF                           BANKMASK(PIR5), 4, b
#define TXB2IP                           BANKMASK(IPR5), 4, b
#define TXB3                             BANKMASK(SPI1TXB), 3, b
#define TXB4                             BANKMASK(SPI1TXB), 4, b
#define TXB5                             BANKMASK(SPI1TXB), 5, b
#define TXB6                             BANKMASK(SPI1TXB), 6, b
#define TXB7                             BANKMASK(SPI1TXB), 7, b
#define TXBNIE                           BANKMASK(PIE3), 4, b
#define TXBNIF                           BANKMASK(PIR3), 4, b
#define TXBNIP                           BANKMASK(IPR3), 4, b
#define TXBO                             BANKMASK(COMSTAT), 5, a
#define TXBP                             BANKMASK(COMSTAT), 4, a
#define TXBnIE                           BANKMASK(PIE5), 4, b
#define TXBnIF                           BANKMASK(PIR5), 4, b
#define TXBnIP                           BANKMASK(IPR5), 4, b
#define TXIE                             BANKMASK(PIE1), 4, b
#define TXIF                             BANKMASK(PIR1), 4, b
#define TXR                              BANKMASK(SPI1CON2), 1, b
#define TXUIE                            BANKMASK(SPI1INTE), 1, b
